{
    "comments":
        {
            "data":
                [
                    
                    {
                        "can_remove":"1",
                        "created_time":"2011-10-21T20:24:09+0000",
                        "from":
                            {
                                "id":"1668381293",
                                "name":"Kevin Morris"
                            },
                        "id":"728337349_252240261490117_3257124",
                        "message":"Great story Shannon.  A great adventure indeed."
                    },
                    
                    {
                        "can_remove":"1",
                        "created_time":"2011-10-22T00:35:20+0000",
                        "from":
                            {
                                "id":"100000070828265",
                                "name":"Mark Farrell"
                            },
                        "id":"728337349_252240261490117_3257797",
                        "message":"Do we get to hear about the safari too?"
                    },
                    
                    {
                        "can_remove":"1",
                        "created_time":"2011-10-22T00:58:40+0000",
                        "from":
                            {
                                "id":"728337349",
                                "name":"Shannon Posniewski"
                            },
                        "id":"728337349_252240261490117_3257867",
                        "message":"I'm not sure I'm going to do the safari. This was a lot of work, and the safari wasn't as awesome for me. I'll probably choose a bunch of the good pictures and caption them at some point. (I was vaguely hoping someone else in the crew was going to do it for me... :-) )"
                    },
                    
                    {
                        "can_remove":"1",
                        "created_time":"2011-10-22T03:46:12+0000",
                        "from":
                            {
                                "id":"1554010659",
                                "name":"Donna Peronace"
                            },
                        "id":"728337349_252240261490117_3258515",
                        "message":"Thanks for posting all of this Poz.  What an amazing adventure you all had!  I like the way you write, so if you choose to write about the safari, I will be reading every post.  :)"
                    }
                ]
        },
    "content":"\nI (and I suspect our whole party) awoke much refreshed the next day. It had cleared out during the night, and had been cold enough to frost the ground and tents. We could see the peak we climbed yesterday, more than 6,700 ft above us.\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/mill-kili-dawn.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/mill-kili-dawn-thumb.jpg\" \/><\/a>\n<figcaption>Our last camp on Kilimanjaro.<\/figcaption>\n<\/figure>\n\nWe ate breakfast (which I barely remembered until John reminded me that they had BACON BACON BACON for us) and started to get our things together for the hike out. Before we left, though, was the \"tipping ceremony\".\n\nTipping isn't optional for Kilimanjaro treks, a substantial portion of what the porters and guides make comes from tips. KPAP has minimum guidelines for tipping; we tipped substantially more. Our team certainly earned every dollar, in our opinion. There is a lot of conflicting advice on the internet regarding how best to go about this. Here's what we did, which I think worked very well.\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/mill-frost.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/mill-frost-thumb.jpg\" \/><\/a>\n<figcaption>Frost at dawn at Millennium Camp<\/figcaption>\n<\/figure>\n\nFirst off, you need to get a list with the name of every porter and guide on it along with what their job is. Your guide should do this for you. We asked for the list at Karanga, I believe. You take this list and decide how much you want to tip. Everyone who does the same job should get the same tip. Your entire party tips as a single group, not individually.\n\nGo over this with your guide. If you're American, you might feel a little squeamish about this whole thing. We feel it's a bit uncouth to talk about tips and especially what tip you gave someone. Try to get over it. Your guide should help make sure you didn't do something too far out of line. He may also have changes to the list. For example, our list changed because of the summit porters we needed.\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/mill-dancing.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/mill-dancing-thumb.jpg\" \/><\/a>\n<figcaption>Celebrate!<\/figcaption>\n<\/figure>\n\nMake packets for each job with the cash for all the people who did the job in it. Write their names, the job, and the per-person tip on the outside. Do not give the tips to anyone yet. Guides fear that if you give the tip to the porter, they'll just skip off without finishing their job. We were also told you shouldn't simply give the tips to the guide for dispersal. They might just take the lion's share and leave little for the porters.\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/tipping-1.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/tipping-1-thumb.jpg\" \/><\/a>\n<figcaption>Bruno explains the tips.<\/figcaption>\n<\/figure>\n\nThe idea, then, is to announce what the tips are to the whole team. They money is then given to the guide to hold until the porter checks in at the gate with the guide and signs off. This binds the guide to what you announce and also makes sure the porters finish their job.  We did not announce our guides' tip as it was significantly larger than the rest, and they already knew what they were getting because the went over everything with us.\n\n(I know that seems like long-winded minutia, but I never found a rational and non-nonsense write-up of tipping for Kili anywhere. Perhaps this will help others on their trips.)\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/tipping-2.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/tipping-2-thumb.jpg\" \/><\/a>\n<figcaption>TIPS!<\/figcaption>\n<\/figure>\n\nAfter breakfast, our porters did some singing with us and we had a general We Did It! celebration. Then we did the tip announcements. We called out the job, names, and tip. They came around and bumped fists or hugged us. They were very enthusiastic and happy, perhaps because we tipped well. You should too. I think that my portion of the tips was $300. For seven days of lugging our crap around, making us hot meals, and otherwise all-but-carrying us up the mountain. Worth it.\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/mweka-hut.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/mweka-hut-thumb.jpg\" \/><\/a>\n<figcaption>Mweka Hut<\/figcaption>\n<\/figure>\n\nAnd then we we put on our packs and started down the mountain. The Camp was in a rather misty area, so there were some scraggly trees. We walked through this sort of mist and low foliage for a while and arrived at Mweka Huts, where we had to sign in. Some groups hike out to Mweka rather than stay at Millennium after summitting.\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/mill-trail-1.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/mill-trail-1-thumb.jpg\" \/><\/a>\n<figcaption>Craig and I: We hiked that mountain right there.<\/figcaption>\n<\/figure>\n\nAfter a short break, we continued on and the mist cleared out a bit. This let us see back up the mountain again where we caught our last glimpse of the peak itself. We stayed just above the clouds for a while and the trees started to get a bit taller. There were a couple cool \"tunnels\" that we went through.\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/mill-tunnel.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/mill-tunnel-thumb.jpg\" \/><\/a>\n<figcaption>Nifty tunnels<\/figcaption>\n<\/figure>\n\nWe dropped back into the mist and into the rainforest. The trail got increasingly muddy and slippery as we descended. We started seeing the flowers again along the trail, and crazy moss that climbed up and over trees. We were free to go our own pace, which made me and my legs happy. There is a very long section of stairs which would have been brutal if I had to take them slowly.\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/mill-trail-3.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/mill-trail-3-thumb.jpg\" \/><\/a>\n<figcaption>Down into the wet, misty rain forest<\/figcaption>\n<\/figure>\n\nThe trail soon turned into a (very sloppy and muddy) dirt road. There were some locals working off trail collecting wood (I think). A bit further in the slop and we arrived at Mweka gate, the terminus of our adventure, where we were swarmed by people selling T-shirts and trying to clean our boots of the mud.\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/mweka-gate.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/mweka-gate-thumb.jpg\" \/><\/a>\n<figcaption>The End: Mweka Gate (unfortunately, there is no actual gate)<\/figcaption>\n<\/figure>\n\nOnce the crew trickled in, we went to the official gatehouse and signed out. They sold some stuff at the gatehouse, but nothing I found really cool. I am surprised that they don't sell \"official\" merchandise such as shirts; they leave that to the solicitors.\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/mweka-gate-bldg.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/mweka-gate-bldg-thumb.jpg\" \/><\/a>\n<figcaption>Every gov't building has a code like this on it. I was amused that they effectively had URLs for their buildings. But, like all naming schemes,they weren't always consistent (as seen here).<\/figcaption>\n<\/figure>\n\nThe road was too messy for Ahsante's bus to get in so we had a short 1\/2 mile walk downhill to get to it. Along the way, local kids wanted to trade stuff with us (like sunglasses) or sell us badges and the like. We met up with Ursula and Nellie at the bus, tromped aboard, and were on our way to a picnic lunch (and beer!) at the Ahsante HQ.\n\nAnd the best thing? No soup.\n\nAnd the beer.\n\n<div style=\"border: solid 1px; padding: 20px; margin-bottom: 20px; background: #EEE7D8;\">\n\nI've been asked several times about the trip and how the experience affected me. There seems to be an expectation that there was some amazing revelation or life-changing moment I will hold on to. There wasn't, really. But I wasn't looking for anything like that (and I don't think I'm wired for that kind of thing anyway).\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/group-shira-edit.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/group-shira-edit-thumb.jpg\" \/><\/a>\n<figcaption>This is why I climbed Kilimanjaro.<\/figcaption>\n<\/figure>\n\nWhat I did get, and I hope my journal and photos show, were some fantastic memories and experiences with dear friends. Even through the demands of the hike, stomach problems, altitude sickness, and exploding knees, we still found space to laugh and have fun and hug. I would never have had the gumption to do anything like this without them. Kilimanjaro and Africa are unlike any place I have ever been, and they gave me the courage to go there and climb to the Roof of Africa.\n\nAnd though it may sound hackneyed or trite, it truly is an adventure I will never forget.\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/dad-and-i.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/dad-and-i-thumb.jpg\" \/><\/a>\n<figcaption>Dad and I<\/figcaption>\n<\/figure>\n<\/div>\n\n<figure>\n<a href=\"https:\/\/picasaweb.google.com\/posniewski\/Millennium?authuser=0&feat=directlink\">\n<img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/millennium.jpg\" \/><\/a>\n<figcaption>Click here to see more photos from this part of the trip.<\/figcaption>\n<\/figure>\n\n",
    "id":"20111020_9_222040",
    "link":"",
    "publishedDate":"2011-10-20T22:20:40+00:00",
    "source":"foamtotem",
    "title":"Kilimanjaro: Mweka Gate",
    "via":"",
    "~orig":
        {
        },
    "~orig.728337349_252240261490117":
        {
            "actions":
                [
                    
                    {
                        "link":"http:\/\/www.facebook.com\/728337349\/posts\/252240261490117",
                        "name":"Comment"
                    },
                    
                    {
                        "link":"http:\/\/www.facebook.com\/728337349\/posts\/252240261490117",
                        "name":"Like"
                    }
                ],
            "application":
                {
                },
            "caption":"foamtotem.org",
            "comments":
                {
                    "data":
                        [
                            
                            {
                                "can_remove":"1",
                                "created_time":"2011-10-21T20:24:09+0000",
                                "from":
                                    {
                                        "id":"1668381293",
                                        "name":"Kevin Morris"
                                    },
                                "id":"728337349_252240261490117_3257124",
                                "message":"Great story Shannon.  A great adventure indeed."
                            },
                            
                            {
                                "can_remove":"1",
                                "created_time":"2011-10-22T00:35:20+0000",
                                "from":
                                    {
                                        "id":"100000070828265",
                                        "name":"Mark Farrell"
                                    },
                                "id":"728337349_252240261490117_3257797",
                                "message":"Do we get to hear about the safari too?"
                            },
                            
                            {
                                "can_remove":"1",
                                "created_time":"2011-10-22T00:58:40+0000",
                                "from":
                                    {
                                        "id":"728337349",
                                        "name":"Shannon Posniewski"
                                    },
                                "id":"728337349_252240261490117_3257867",
                                "message":"I'm not sure I'm going to do the safari. This was a lot of work, and the safari wasn't as awesome for me. I'll probably choose a bunch of the good pictures and caption them at some point. (I was vaguely hoping someone else in the crew was going to do it for me... :-) )"
                            },
                            
                            {
                                "can_remove":"1",
                                "created_time":"2011-10-22T03:46:12+0000",
                                "from":
                                    {
                                        "id":"1554010659",
                                        "name":"Donna Peronace"
                                    },
                                "id":"728337349_252240261490117_3258515",
                                "message":"Thanks for posting all of this Poz.  What an amazing adventure you all had!  I like the way you write, so if you choose to write about the safari, I will be reading every post.  :)"
                            }
                        ],
                    "paging":
                        {
                            "next":"https:\/\/graph.facebook.com\/728337349_252240261490117\/comments?access_token=202981499713630|f0e29551db76a6dbed4c8d5e.1-728337349|1C7yRomzW6wd2-7ogKO4lZLcdEI&limit=25&offset=25"
                        }
                },
            "created_time":"2011-10-21T18:20:30+0000",
            "description":"I (and I suspect our whole party) awoke much refreshed the next day. It had cleared out during the night, and had been cold enough to frost the ground and tents.",
            "from":
                {
                    "id":"728337349",
                    "name":"Shannon Posniewski"
                },
            "icon":"https:\/\/s-static.ak.facebook.com\/rsrc.php\/v1\/yR\/r\/23eNFy_VOig.gif",
            "id":"728337349_252240261490117",
            "likes":
                {
                    "count":1,
                    "data":
                        [
                            
                            {
                                "id":"1554010659",
                                "name":"Donna Peronace"
                            }
                        ]
                },
            "link":"http:\/\/foamtotem.org\/2011\/20111020_9_222040.html",
            "message":"Don't miss the exciting conclusion to our trek up Kilimanjaro.",
            "name":"Kilimanjaro: Mweka Gate",
            "picture":"https:\/\/s-external.ak.fbcdn.net\/safe_image.php?d=AQDg6U06KEI-Wq76&w=90&h=90&url=http%3A%2F%2Ffoamtotem.org%2Fdaily%2Fimages%2Fkili%2Fgroup-shira-edit-thumb.jpg",
            "privacy":
                {
                    "allow":"0",
                    "deny":"0",
                    "description":"Friends of Friends",
                    "value":"FRIENDS_OF_FRIENDS"
                },
            "type":"link",
            "updated_time":"2011-10-22T03:46:12+0000"
        }
}