{
    "comments":
        {
            "data":
                [
                    
                    {
                        "can_remove":"1",
                        "created_time":"2011-10-12T13:23:39+0000",
                        "from":
                            {
                                "id":"1554010659",
                                "name":"Donna Peronace"
                            },
                        "id":"728337349_172076002877762_794410",
                        "message":"Another great post-thanks!"
                    },
                    
                    {
                        "can_remove":"1",
                        "created_time":"2011-10-12T18:08:45+0000",
                        "from":
                            {
                                "id":"591116199",
                                "name":"Wei-Ling Lorelai Wu"
                            },
                        "id":"728337349_172076002877762_795337",
                        "message":"I'm really digging these!"
                    }
                ]
        },
    "content":"\nI slept fairly well. It was quite cold, but was warm enough in the bag. Too warm, sometimes. I still hadn't found the right clothes to wear so that I didn't overheat. The best seemed to be a long sleeve baselayer shirt, running tights, and wool socks.\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/barranco-breakfast.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/barranco-breakfast-thumb.jpg\" \/><\/a>\n<figcaption>Porridge!<\/figcaption>\n<\/figure>\n\nI am shocked to discover that I haven't yet mentioned porridge. Just as dinner always started with a soup of some kind, breakfast started with porridge every day. On this day, we also had hard boiled eggs, and sausage (which means \"hot dogs\" in Tanzania even in restaurants-- you have been warned). I only had porridge (augmented with raw sugar) because I don't like hard boiled eggs. I had also eaten a Clif bar during the night as I exhorted my Dad to drink more fluids.\n\nI mentioned at some point that I was happy with the \"fanciness\" of our trek except for one thing, which the photo above reminded me of. Our camp chairs were stools; they had no backs. I would have been esctatic to have a chair with a back on it. The energy to keep me upright on a stool wasn't always energy I wanted to part with!\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/barranco-cleanup.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/barranco-cleanup-thumb.jpg\" \/><\/a>\n<figcaption>Camp getting packed up, you can see some people climbing up the wall.<\/figcaption>\n<\/figure>\n\nAlthough not a hundred percent, my Dad seemed to be getting better. I know that I felt much better, and most everyone seemed OK compared to the previous night. Once again, Kat bounced back and was excited to climb up the wall. Today was supposed to be pretty easy as well. Around 3 miles with the high point at the top of the wall. Like yesterday, our destination was only a bit higher than where we stayed the previous day. Hike high, sleep low.\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/barranco-wall.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/barranco-wall-thumb.jpg\" \/><\/a>\n<figcaption>Long line of porters and trekkers going up the Barranco Wall.<\/figcaption>\n<\/figure>\n\nWe packed up and started seeing porters and other groups beginning the climb up the Barranco Wall. The camp is right at the base of the wall, which is a very steep cliff. Like the rest of Kilimanjaro, this wasn't a very technical climb; one occasionally needed to use one's hands but it was mostly like going up very steep stairs.\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/porters-sing.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/porters-sing-thumb.jpg\" \/><\/a>\n<figcaption>Jambo! Hakuna matata!<\/figcaption>\n<\/figure>\n\nBut before attacking the Barranco Wall, many of our porters got together and sang a bit for us. Most of them actually seemed into it and were having fun. (I'm happy for this because I didn't want a \"show\".) We were watching them for a bit, and they brought us over and had us join in. It was fun. (I think we did this to pass some time; since we're a slower group I think our guides decided to put us near the end of the mass of people climbing.)\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/scaling-barranco.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/scaling-barranco-thumb.jpg\" \/><\/a>\n<figcaption>Up we go!<\/figcaption>\n<\/figure>\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/kat-wall.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/kat-wall-thumb.jpg\" \/><\/a>\n<figcaption>Both of Kat's knees have blown up, and yet she climbs the wall!<\/figcaption>\n<\/figure>\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/porters-wall.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/porters-wall-thumb.jpg\" \/><\/a>\n<figcaption>And the porters do it with 25kg on their heads.<\/figcaption>\n<\/figure>\n\nWe shouldered our gear and started up the wall. I loved it, and I think some of the group which had been worried about it ended up enjoying it. The views, as always, were amazing. We could see the entire Barranco Camp from the top as well as the trail into and out of it. It took around an hour and a half to the top, a climb of around 800 ft. \n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/barranco-from-wall.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/barranco-from-wall-thumb.jpg\" \/><\/a>\n<figcaption>At the top, looking back over Barranco Camp (right, below center, now empty of tents).<\/figcaption>\n<\/figure>\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/bruno-rufano.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/bruno-rufano-thumb.jpg\" \/><\/a>\n<figcaption>Bruno and Rufano (our guides) taking a break at the top. (Note that Rufano is wearing gaiters to reduce the amount of dust that gets in his shoes. In general, it's not easy to guess what the right thing to wear is on any given day. My tip is to look at what your guides are wearing.)<\/figcaption>\n<\/figure>\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/karanga-trail.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/karanga-trail-thumb.jpg\" \/><\/a>\n<figcaption>Dusty, dry, desolate.<\/figcaption>\n<\/figure>\n\nAfter a break, we spent a long time slowly descending, and then climbed back up a bit. From the top of this rise, we could see Karanaga Camp-- and the soul-crushing requirement that you have to drop a long way down (below the altitude we started at, even) and climb back up to get there. This was especially troublesome for me because I was on the way to a serious \"bathroom emergency\". I really didn't want to go on the trail. (There was very little cover, and it wasn't going to be a comfortable time anyway.)\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/soul-crushing.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/soul-crushing-thumb.jpg\" \/><\/a>\n<figcaption>Karanga Valley, the surprise conclusion to the day.<\/figcaption>\n<\/figure>\n\nHence the soul-crushing I mentioned. The camp was visible, but still a long way off because we had to cross the valley. Long story short-- and I know you're all happy to have it shortened at this point. These posts seem to have become more a diary of the crew's sleeping, eating, and bathroom habits than anything else. But I suppose that's what really matters when you're hiking at an unaccustomed altitude in a foreign land. So, long story short: it was an uncomfortable hike for me as I expended 50% of my energy just controlling myself. I got to camp in time, though I had to plead with Jenn for first dibs on the Internet Cafe.\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/karanga-trail.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/karanga-valley-thumb.jpg\" \/><\/a>\n<figcaption>A steep drop into Karanga Valley.<\/figcaption>\n<\/figure>\n\nCrisis averted, and more Immodium ingested, we had our lunch. A treat today with meat pies, french fries, veggie curry, fresh mango, and some form of coleslaw. The french fries were especially welcome. For the first time in a while, food started tasting good again, though I avoided the curry and the coleslaw.\n\nWe rested a bit, and I tried to clean myself up a bit. I was filthy. One cannot win against the dust. My hands were unbelievably dirty, even after washing them. Cleaning out under the fingernails was an impossibility. (I didn't get them entirely clean until after the safari.) I used a couple no-rinse cleaning wipes to really scrub my hands and face until I felt a bit more presentable. Between the dust and repeated applications of sunblock, one can get pretty gnarly.\n\nThe Karanga Camp is on quite a slope, so everyone's tent is a bit akimbo. It's not a very nice site: largely unprotected, barren, rocky sloped plain. It feels like a waypoint rather than a camp. Karanga is where the extra day is for the trek. Some people bypass this site entirely and go straight to Barafu. Even though the site wasn't very nice, I'm very happy we added the extra day.\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/karanga-down.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/karanga-down-thumb.jpg\" \/><\/a>\n<figcaption>Karanga was cold and sloped.<\/figcaption>\n<\/figure>\n\nDinner was good: some cold chicken, pasta elbows, veggie curry, and (of course) soup. But the crown jewel was the fresh mango, which tasted like awesome wrapped in amazing dipped in fantastic. At least to me. Those who hesitated when I asked if they wanted seconds didn't have time to reconsider.\n\nBruno gave us a briefing about the upcoming summit day(s) and all that stuff. In brief: we would hike to Barafu Camp, eat lunch, take a break, eat dinner, take a nap until 11pm, and then begin the hike up to the summit. The idea is to reach Stella Point (where the steep part ends, nearly at the top) around sunrise, finish the hike to the summit, and the descend back to Barafu. It would be a very long day.\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/karanga-up.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/karanga-up-thumb.jpg\" \/><\/a>\n<figcaption>Uhuru Peak from Karanga. Almost looks do-able from here!<\/figcaption>\n<\/figure>\n\nThe night was colder than the previous night. My arms got a little cold, but if I fully zipped up the bag, I'd catch fire. On my now-standard two nighttime visits to \"see the stars\", I was not disappointed. The full moon was absolutely amazing. The sky above us is very clear at night, probably because there isn't any air. So the moon was sharp and huge and very bright. There's no need for a flashlight when it's up. Unfortunately, the lower reaches of Kili and the plains were still not visible through the clouds below us. I could faintly see what were probably the lights from Moshi through them, but that's all.\n\n<figure>\n<a href=\"https:\/\/picasaweb.google.com\/posniewski\/Karanga?authuser=0&feat=directlink\">\n<img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/karanga.jpg\" \/><\/a>\n<figcaption>Click here to see more photos from this part of the trip.<\/figcaption>\n<\/figure>\n\n",
    "id":"20111012_9_014954",
    "link":"",
    "publishedDate":"2011-10-12T01:49:54+00:00",
    "source":"foamtotem",
    "title":"Kilimanjaro: Karanga",
    "via":"",
    "~orig":
        {
        },
    "~orig.728337349_172076002877762":
        {
            "actions":
                [
                    
                    {
                        "link":"http:\/\/www.facebook.com\/728337349\/posts\/172076002877762",
                        "name":"Comment"
                    },
                    
                    {
                        "link":"http:\/\/www.facebook.com\/728337349\/posts\/172076002877762",
                        "name":"Like"
                    }
                ],
            "application":
                {
                },
            "caption":"foamtotem.org",
            "comments":
                {
                    "data":
                        [
                            
                            {
                                "can_remove":"1",
                                "created_time":"2011-10-12T13:23:39+0000",
                                "from":
                                    {
                                        "id":"1554010659",
                                        "name":"Donna Peronace"
                                    },
                                "id":"728337349_172076002877762_794410",
                                "message":"Another great post-thanks!"
                            },
                            
                            {
                                "can_remove":"1",
                                "created_time":"2011-10-12T18:08:45+0000",
                                "from":
                                    {
                                        "id":"591116199",
                                        "name":"Wei-Ling Lorelai Wu"
                                    },
                                "id":"728337349_172076002877762_795337",
                                "message":"I'm really digging these!"
                            }
                        ]
                },
            "created_time":"2011-10-12T02:24:32+0000",
            "description":"Scaling Barranco Wall and on the way to Karanga.",
            "from":
                {
                    "id":"728337349",
                    "name":"Shannon Posniewski"
                },
            "icon":"https:\/\/s-static.ak.facebook.com\/rsrc.php\/v1\/yR\/r\/23eNFy_VOig.gif",
            "id":"728337349_172076002877762",
            "likes":
                {
                    "count":3,
                    "data":
                        [
                            
                            {
                                "id":"728337349",
                                "name":"Shannon Posniewski"
                            },
                            
                            {
                                "id":"591116199",
                                "name":"Wei-Ling Lorelai Wu"
                            },
                            
                            {
                                "id":"1134692210",
                                "name":"Shelley Day Posniewski"
                            }
                        ]
                },
            "link":"http:\/\/www.foamtotem.org\/2011\/20111012_9_014954.html",
            "message":"Porridge, songs, scaling a cliff, and a crisis averted on our way to Karanga Camp.",
            "name":"Kilimanjaro: Karanga",
            "picture":"https:\/\/s-external.ak.fbcdn.net\/safe_image.php?d=AQCTblPrZsueeYii&w=90&h=90&url=http%3A%2F%2Ffoamtotem.org%2Fdaily%2Fimages%2Fkili%2Fscaling-barranco-thumb.jpg",
            "privacy":
                {
                    "allow":"0",
                    "deny":"0",
                    "description":"Friends of Friends",
                    "value":"FRIENDS_OF_FRIENDS"
                },
            "type":"link",
            "updated_time":"2011-10-12T18:08:45+0000"
        }
}