{
    "comments":
        {
            "data":
                [
                    
                    {
                        "can_remove":"1",
                        "created_time":"2011-10-22T02:27:29+0000",
                        "from":
                            {
                                "id":"1661085968",
                                "name":"Melissa Bourgeois"
                            },
                        "id":"728337349_226294730767996_2457486",
                        "message":"Thanks. I was psyched to see the post tonight"
                    },
                    
                    {
                        "can_remove":"1",
                        "created_time":"2011-10-22T03:35:43+0000",
                        "from":
                            {
                                "id":"1554010659",
                                "name":"Donna Peronace"
                            },
                        "id":"728337349_226294730767996_2457813",
                        "message":"Thanks I've been waiting for this."
                    }
                ]
        },
    "content":"\nWe began our descent from Stella Point. It was a bit treacherous because of the gravel, dust, and scree. So we carefully zig-zagged on the switchbacks for a bit, but that seemed to be a losing battle and I was pretty much done with going slow. As amazing and fantastic as summitting was, I wanted to get down.\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/descent-1.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/descent-1-thumb.jpg\" \/><\/a>\n<figcaption>7 hours up, 2 hours down<\/figcaption>\n<\/figure>\n\nWe began to steer to the left, away from the ridge where we went up and where the scree was actually deeper. There were less switchbacks, and we sort of plowed through the dust. Each step you would sink in and slide a bit. It felt a bit like skiing and walking at the same time. This was pretty hard on one's knees and legs, but I couldn't imagine carefully walking down the way we went up.\n\nAbout midway, we were met by some of the porters with juice. Once again, exactly what I needed. I was beginning to run low on energy even with the Gu. For some reason, I didn't fish out another Clif Bar and eat it along the way. I think I was just focused on getting down.\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/above-barafu.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/above-barafu-thumb.jpg\" \/><\/a>\n<figcaption>Barafu Camp. We were stationed over the rise, which is a surprising distance away.<\/figcaption>\n<\/figure>\n\nWe didn't really see any of this trail on the way up because it was dark out, but there really isn't much to see it turns out. It's unvegetated rocks, boulders, gravel, and dust. The view (when facing downhill) was expansive, but it was largely static until we got to a field of boulders around 3\/4 of the way down.\n\nAt the boulders, we joined back up with the trail on which we actually ascended. We descended more and eventually arrived at the top of the cliff area above Barafu Camp. These were trickier to get down than they were to get up, but soon we were at the bottom wth Camp in sight. Even so, it felt like forever before we actually got to our area on the far side of the Camp.\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/arrival.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/arrival-thumb.jpg\" \/><\/a>\n<figcaption>Barafu Camp. We were stationed over the rise, which is a surprising distance away.<\/figcaption>\n<\/figure>\n\nWe trudged into Camp where we found Kat in the mess tent. She was doing pretty well. I was not doing pretty well; I was out of gas. I sat in the mess tent for a while, uncontrollably shaking as if shivering (though I wasn't really cold). I got something to eat as the rest of the crew got to camp. Our ascent to Stella Point took over seven hours, the descent just two.\n\nAnd then I reminded that we had to pack up and go to the next camp. That was not a happy moment for me. We had a little while for a break first, though. I ate a Snickers bar Kat had left over, and it tasted great. I got into my tent and sleeping bag to try and digest and control the shakes. They subsided in about 15 minutes and I was feeling much better in an hour or so.\n\nWhich was good, because that's when we had to pack up and go. The trail from Barafu to Millenium Camp is a continuous slope, but it's not as treacherous or steep as the summit. Like the summit, though, it's dusty. We spread out across the trail a bit to avoid the clouds from the person in front.\n\n<figure>\n<figcaption>As an indicator of our exhaustion, I can find no pictures of this leg of the trek.<\/figcaption>\n<\/figure>\n\nThey let us break into two groups which was good for me because I really needed to just let my legs stretch out and walk. For me, at least, a good constant rhythm and pace is safer and more controllable than tiny, careful steps. Rufano let us speed up a bit, which let me hike comfortably.\n\nWe eventually dropped into the clouds (Bruno would insist that it is \"mist\") and visibility dropped off a lot. And we started getting wet from walking through it. As we entered Camp and found the Hut to sign in, it was drizzling a bit. Rufano brought us to our area and we rested for a while.\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/mill-kili.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/mill-kili-thumb.jpg\" \/><\/a>\n<figcaption>The peak from Millennium Camp. (Taken the next morning.)<\/figcaption>\n<\/figure>\n\nI know we had dinner, but I can't remember what it was at this point. I would bet, however, that there was soup. We had hiked up 4,000 ft over 3 miles to the summit, and back down 6,800 ft over 5 miles. We were on our feet hiking for almost 15 hours. I didn't last long before I went to bed.",
    "id":"20111020_9_203945",
    "link":"",
    "publishedDate":"2011-10-20T20:39:45+00:00",
    "source":"foamtotem",
    "title":"Kilimanjaro: Descent to Millennium",
    "via":"",
    "~orig":
        {
        },
    "~orig.728337349_226294730767996":
        {
            "actions":
                [
                    
                    {
                        "link":"http:\/\/www.facebook.com\/728337349\/posts\/226294730767996",
                        "name":"Comment"
                    },
                    
                    {
                        "link":"http:\/\/www.facebook.com\/728337349\/posts\/226294730767996",
                        "name":"Like"
                    }
                ],
            "application":
                {
                },
            "caption":"foamtotem.org",
            "comments":
                {
                    "data":
                        [
                            
                            {
                                "can_remove":"1",
                                "created_time":"2011-10-22T02:27:29+0000",
                                "from":
                                    {
                                        "id":"1661085968",
                                        "name":"Melissa Bourgeois"
                                    },
                                "id":"728337349_226294730767996_2457486",
                                "message":"Thanks. I was psyched to see the post tonight"
                            },
                            
                            {
                                "can_remove":"1",
                                "created_time":"2011-10-22T03:35:43+0000",
                                "from":
                                    {
                                        "id":"1554010659",
                                        "name":"Donna Peronace"
                                    },
                                "id":"728337349_226294730767996_2457813",
                                "message":"Thanks I've been waiting for this."
                            }
                        ],
                    "paging":
                        {
                            "next":"https:\/\/graph.facebook.com\/728337349_226294730767996\/comments?access_token=202981499713630|f0e29551db76a6dbed4c8d5e.1-728337349|1C7yRomzW6wd2-7ogKO4lZLcdEI&limit=25&offset=25"
                        }
                },
            "created_time":"2011-10-21T02:28:14+0000",
            "description":"We began our descent from Stella Point. It was a bit treacherous because of the gravel, dust, and scree.",
            "from":
                {
                    "id":"728337349",
                    "name":"Shannon Posniewski"
                },
            "icon":"https:\/\/s-static.ak.facebook.com\/rsrc.php\/v1\/yR\/r\/23eNFy_VOig.gif",
            "id":"728337349_226294730767996",
            "likes":
                {
                    "count":3,
                    "data":
                        [
                            
                            {
                                "id":"728337349",
                                "name":"Shannon Posniewski"
                            },
                            
                            {
                                "id":"1554010659",
                                "name":"Donna Peronace"
                            },
                            
                            {
                                "id":"749199277",
                                "name":"Jeremy Collins"
                            }
                        ]
                },
            "link":"http:\/\/foamtotem.org\/2011\/20111020_9_203945.html",
            "message":"This time we ski down gravel, and run into bonking and the shakes (no, it's not band).",
            "name":"Kilimanjaro: Descent to Millennium",
            "picture":"https:\/\/s-external.ak.fbcdn.net\/safe_image.php?d=AQCUKLaxbFVzcAIA&w=90&h=90&url=http%3A%2F%2Ffoamtotem.org%2Fdaily%2Fimages%2Fkili%2Farrival-thumb.jpg",
            "privacy":
                {
                    "allow":"0",
                    "deny":"0",
                    "description":"Friends of Friends",
                    "value":"FRIENDS_OF_FRIENDS"
                },
            "type":"link",
            "updated_time":"2011-10-22T03:35:43+0000"
        }
}