{
    "comments":
        {
            "data":
                [
                    
                    {
                        "can_remove":"1",
                        "created_time":"2011-10-10T00:36:11+0000",
                        "from":
                            {
                                "id":"1241587631",
                                "name":"Carol Barrick"
                            },
                        "id":"728337349_290797340930973_4258272",
                        "likes":1,
                        "message":"How amazing Poz!  Good for you and thanks for sharing!",
                        "user_likes":"1"
                    },
                    
                    {
                        "can_remove":"1",
                        "created_time":"2011-10-10T01:09:15+0000",
                        "from":
                            {
                                "id":"1134692210",
                                "name":"Shelley Day Posniewski"
                            },
                        "id":"728337349_290797340930973_4258366",
                        "likes":1,
                        "message":"Love reading these posts.",
                        "user_likes":"1"
                    },
                    
                    {
                        "can_remove":"1",
                        "created_time":"2011-10-10T04:28:21+0000",
                        "from":
                            {
                                "id":"1554010659",
                                "name":"Donna Peronace"
                            },
                        "id":"728337349_290797340930973_4259109",
                        "message":"Ravens are amazing birds.  They are so intelligent.  I love reading these posts."
                    }
                ]
        },
    "content":"\nI slept off and on all night. At 11:30pm or so, my bladder alarm went off and I had to decide if I would brave the outside or use a pee bottle. Since I had to get out of the sleeping bag anyway, I decided that I would go out. I ended up never using the pee bottle, though others (such as my Dad) did. I got dressed and went outside and (in this case) was happy that I did.\n\nThe week we had chosen to climb Kili coincided with a moon waxing to near full on summit day. When I exited the tent, I had no need for a flashlight because the moon was up and very bright. The peak was clearly visible in the moonlight. It was pretty amazing. Dan had also gotten up, and was setting up his new camera to take some night shots. (Unfortunately, I don't think any of them came out.)\n\nIt was cold out. I'm not sure if it dipped below freezing, but I'm sure it got pretty close.\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/shira-trail-clouds.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/shira-trail-clouds-thumb.jpg\" \/><\/a>\n<figcaption>Just above the clouds on the way to Shira Camp.<\/figcaption>\n<\/figure>\n\nWe got up a bit before sunrise (which was at 6:30am or so), washed up, ate breakfast, and packed up. Some kind of miracle happened during the night because Kat was able to walk on her knee. It wasn't \"fixed\" or anything like that, but she was able to continue the hike. I am amazed by this turn even now, because the previous day I thought the knee was completely finished. We fiddled with her knee brace so it was more comfortable and she was good to go.\n\nI had been hoping for a good view in the morning, because just around sunset I was able to see the lower elevations of Kilimanjaro as well as the plains below peeking through the clouds. It turns out that the previous day was the last time we saw anything of the world below 2,500 meters. There was a solid cloud bank below us until our last day when we dropped below it.\n\nOn later days they told us to get up earlier, so I suspect we took a bit too long getting our act together on this day. Plus, I think our group moved more slowly than a typical group. Estimated times to the next camp are significantly shorter than what we took. One reason is that they always kept the group together; we went the speed of our slowest member.\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/group-shira-edit.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/group-shira-edit-thumb.jpg\" \/><\/a>\n<figcaption>The crew half-way to Shira camp (the peak is on the right, so very far away).<\/figcaption>\n<\/figure>\n\nIt started out a bit misty and foggy but we climbed out of it fairly soon. We continued steadily along top of spine between two valleys, mostly stepping up rocks now. The rain forest was left behind and we were walking through short, stunted trees. It got steeper and steeper, especially in the last stretch before lunch, which was later than my body wanted it.\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/shira-steps.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/shira-steps-thumb.jpg\" \/><\/a>\n<figcaption>Some steps greet us just before the lunch stop.<\/figcaption>\n<\/figure>\n\nLunch was a hot meal. The mess tent was set up (as was the all-important tentapotty). Though, the food wasn't very appetizing to me, everyone else seemed happy for it. I was unable to remember what it was even for my journal written that night.\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/raven.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/raven-thumb.jpg\" \/><\/a>\n<figcaption>I love these ravens. (<a href=\"http:\/\/www.pbase.com\/image\/84126236\">Click here for a better picture<\/a><\/figcaption>\n<\/figure>\n\nThe lunch spot (shared by everyone else going on this route-- there were probably a dozen or more tents set up) was well-known to the White-Naped Ravens who were on the prowl for leftovers. They have big curved beaks with a white tip that you most certainly would not like to be pecked with.\n\nBecause this trail follows along a spine and there's very little in the way of trees, you can see the trail for quite some distance (both backwards and forwards). So, we could see people way ahead of us going up perhaps dauntingly steep sections. They weren't so bad once we got to them, however. The views were great all along this trail.\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/helichrysum-meyerijohannis.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/helichrysum-meyerijohannis-thumb.jpg\" \/><\/a>\n<figcaption><i>Helichrysum meyetjohannis<\/i>, or as I call it, <i>Pretty flower<\/i><\/figcaption>\n<\/figure>\n\nLunch finished, we continued on. After about an hour of continuous climb, we reached the lip of the plateau. The trailed turns and goes flat and then a moderate slope down to the Shira campsite, where we found our tents. Because Shira is so open, we could really see how many people were also on the mountain. There were probably dozen or so separate groups, each with a bunch of tents. (I suspect there were more, actually.) For our snack, we had popcorn and freshly roasted peanuts (and of course hot drinks).\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/shira-camp.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/shira-camp-thumb.jpg\" \/><\/a>\n<figcaption>Shira Camp (you see about half of it here) and Uhuru peak.<\/figcaption>\n<\/figure>\n\nAt around 5pm, we took an acclimatization hike to bring us a bit higher in altitude for a while. (We would return to sleep, of course.) The first stop was Shira Cave, which was used as an actual shelter for many years. You're not allowed to use it any more; tents only. From there, we walked to the \"Window\" which is a rock formation like... a window. We were all pretty tired, but the guides started to fool around up on it. So some of us couldn't not climb up into and around it too.\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/window.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/window-thumb.jpg\" \/><\/a>\n<figcaption>Bruno, Chris, me, Craig, and my Dad at the window.<\/figcaption>\n<\/figure>\n\nWe started back as the sun began to set, and arrived back at camp a bit after the sun actually went down. The sunset was really beautiful and gave everything a warm, orangey glow. During the walk back, I started to get a headache, though when I stopped at camp it went away. Again, dinner wasn't too appetizing to me, but I forced myself to eat. Every meal starts with soup. I am not a big soup fan to start with, so I was now officially sick of soup.\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/shira-sunset.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/shira-sunset-thumb.jpg\" \/><\/a>\n<figcaption>Uhuru peak at sunset from Shira plateau.<\/figcaption>\n<\/figure>\n\nAll that hiking had worn us out, and we went to bed pretty soon after dinner. The hike had an overall rise of 2,700 feet over 3 miles. That's pretty steep!\n\nBecause I had gotten the headache (and had minor flareups during the day too) and the appetite issues, I decided that I would begin taking Diamox. I had waffled on taking it for a month before the trip. I had tried it at home and didn't like the tingly sensation in my extremeties, the diuretic effects, or the minor mood change it brought. (The mood change might have been a corellated but non-causal event, but I didn't have the druthers to retest.) But being able to sleep and hike without headaches was more important.\n\n<figure>\n<a href=\"https:\/\/picasaweb.google.com\/posniewski\/Shira?authuser=0&feat=directlink\">\n<img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/shira.jpg\" \/><\/a>\n<figcaption>Click here to see more photos from this part of the trip.<\/figcaption>\n<\/figure>\n",
    "id":"20111009_9_222846",
    "link":"",
    "publishedDate":"2011-10-09T22:28:46+00:00",
    "source":"foamtotem",
    "title":"Kilimanjaro: Shira Camp",
    "via":"",
    "~orig":
        {
        },
    "~orig.728337349_290797340930973":
        {
            "actions":
                [
                    
                    {
                        "link":"http:\/\/www.facebook.com\/728337349\/posts\/290797340930973",
                        "name":"Comment"
                    },
                    
                    {
                        "link":"http:\/\/www.facebook.com\/728337349\/posts\/290797340930973",
                        "name":"Like"
                    }
                ],
            "application":
                {
                },
            "caption":"foamtotem.org",
            "comments":
                {
                    "data":
                        [
                            
                            {
                                "can_remove":"1",
                                "created_time":"2011-10-10T00:36:11+0000",
                                "from":
                                    {
                                        "id":"1241587631",
                                        "name":"Carol Barrick"
                                    },
                                "id":"728337349_290797340930973_4258272",
                                "likes":1,
                                "message":"How amazing Poz!  Good for you and thanks for sharing!",
                                "user_likes":"1"
                            },
                            
                            {
                                "can_remove":"1",
                                "created_time":"2011-10-10T01:09:15+0000",
                                "from":
                                    {
                                        "id":"1134692210",
                                        "name":"Shelley Day Posniewski"
                                    },
                                "id":"728337349_290797340930973_4258366",
                                "likes":1,
                                "message":"Love reading these posts.",
                                "user_likes":"1"
                            },
                            
                            {
                                "can_remove":"1",
                                "created_time":"2011-10-10T04:28:21+0000",
                                "from":
                                    {
                                        "id":"1554010659",
                                        "name":"Donna Peronace"
                                    },
                                "id":"728337349_290797340930973_4259109",
                                "message":"Ravens are amazing birds.  They are so intelligent.  I love reading these posts."
                            }
                        ]
                },
            "created_time":"2011-10-09T23:17:49+0000",
            "description":"I slept off and on all night. At 11:30pm or so, my bladder alarm went off and I had to decide if I would brave the outside or use a pee bottle.",
            "from":
                {
                    "id":"728337349",
                    "name":"Shannon Posniewski"
                },
            "icon":"https:\/\/s-static.ak.facebook.com\/rsrc.php\/v1\/yR\/r\/23eNFy_VOig.gif",
            "id":"728337349_290797340930973",
            "likes":
                {
                    "count":4,
                    "data":
                        [
                            
                            {
                                "id":"728337349",
                                "name":"Shannon Posniewski"
                            },
                            
                            {
                                "id":"1554010659",
                                "name":"Donna Peronace"
                            },
                            
                            {
                                "id":"1134692210",
                                "name":"Shelley Day Posniewski"
                            },
                            
                            {
                                "id":"1361476318",
                                "name":"Michele Liguori"
                            }
                        ]
                },
            "link":"http:\/\/www.foamtotem.org\/2011\/20111009_9_222846.html",
            "message":"Pee bottles, white-naped ravens, and an amazing sunset.",
            "name":"Kilimanjaro: Shira Camp",
            "picture":"https:\/\/s-external.ak.fbcdn.net\/safe_image.php?d=AQAyl_lbRJAHQ_eq&w=90&h=90&url=http%3A%2F%2Ffoamtotem.org%2Fdaily%2Fimages%2Fkili%2Fshira-sunset-thumb.jpg",
            "privacy":
                {
                    "allow":"0",
                    "deny":"0",
                    "description":"Friends of Friends",
                    "value":"FRIENDS_OF_FRIENDS"
                },
            "type":"link",
            "updated_time":"2011-10-10T04:28:21+0000"
        }
}