{
    "content":"<blockquote>Update: I updated the heatmap cutoffs and the re-averaging algorithm a bit. Text below has been updated.<\/blockquote>\n\nI'm now caching images of the maps for all my runs. The live maps were very expensive. Once I got more than two on a page, it became irritating to even scroll the page. One would have to wait until they all loaded before the browser became responsive again. So, now I'm caching an image of them. This was not the easiest thing to get.\n\nI'm lucky I can get them at all, I suppose. Google provides a static map image API which is the only reason this is even possible. Everything on the map is encoded into a giant URL which you send to Google, who renders the map on the server and returns it as an image. Pretty awesome, actually. Foam Totem does this periodically and caches the resulting image.\n\nGoogle Maps can take a KML file and display it. All I have to do is provide them with a URL for the file. Runmeter already provides that for me, which is cool. If you click on any of the shortlinks (or the map images themselves, now), it will take you to Google Maps and you can see the name of the KML file. Frustratingly, though, the static maps API doesn't read KML files. All was not lost, however, as it lets me specify a path in the URL.\n\nWell, that'd be great except that the URL I send to Google has a length limit of around 1500 characters. The path information is much, much longer than that. So I needed to find a way to reduce the number of data points for the cached map. Before I wrote my own, I was able to find a Perl module (Math::Polygon) which has a straightforward simplifier that seems to produce adequate results.\n\nAt the same time, I really wanted to show my pace on the map so I can see where I am running fast or slow. The data was hidden away in the KML file that Runmeter provides. Since I am now fetching, spindling, and mutilating it, I figured I could add this in to. Of course, nothing is easy: because the path is being reduced I have to also reduce the pace information intelligently. I did a simple weighted average (by time) of the pace. It seems right more or less.\n\nSo now I have fancy heatmaps for my runs. From slowest to fastest: Red, Purple, Blue, Cyan. The cutoffs are hardcoded right now based on my whim. Red is anything at or below what I would consider an easy jog (9:30 pace and slower). Purple is 8:39 pace and slower, Blue is less than 8:00, and Cyan is anything faster than that. It's all a bit squishy, of course, because I'm averaging what are already averages and I have a limited number of points to which I can assign colors.\n\nFuture possibilities: <strike>I'm considering making so when you click on the map, it gets replaced with the live map.<\/strike> <i>(Did it!)<\/i> Now that I'm fetching the KML files from Runmeter, I could copy and fiddle with it so that it has the heatmap data in it to, and serve it myself. Lastly, I'd like to add the mile-markers back in.",
    "id":"20110624_9_005510",
    "link":"",
    "publishedDate":"2011-06-24",
    "source":"foamtotem",
    "title":"Caching Run Maps",
    "via":""
}