{
    "comments":
        {
            "data":
                [
                    
                    {
                        "can_remove":"1",
                        "created_time":"2011-10-03T02:07:51+0000",
                        "from":
                            {
                                "id":"100000449847369",
                                "name":"Carol Kuhn"
                            },
                        "id":"728337349_222596554466176_2423032",
                        "message":"Pizza????"
                    },
                    
                    {
                        "can_remove":"1",
                        "created_time":"2011-10-04T04:17:33+0000",
                        "from":
                            {
                                "id":"1554010659",
                                "name":"Donna Peronace"
                            },
                        "id":"728337349_222596554466176_2428304",
                        "message":"This is great Poz!  I'm really enjoying reading your blog."
                    }
                ]
        },
    "content":"\nWe got up for a 7:30am breakfast and a visit to \"The Coffee Shop\", which was recommended in the guidebook. A nice place (good coffee and breakfast pastries), but clearly not used by your typical locals. The only people we saw there were trekkers like us.\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/coffee-shop.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/coffee-shop-thumb.jpg\" \/><\/a>\n<figcaption>The Coffee Shop<\/figcaption>\n<\/figure>\n\nWe returned to the hotel and met up Nelly, our luggage (yay!), and our guide, Bruno. Craig, Kat, and I were very happy to see our stuff. I was a little sick of wearing the same clothes and didn't really want to buy or rent everything for the trek in Moshi.\n\nAt 10am, Bruno gave us an orientation to the climb. He went over the plan for each day, showing us on a map where we'd be, how long each day was, and that sort of stuff. It matched what the guidebook said pretty closely. My impression of Bruno at the time was that he was a nice guy and that his English was pretty good. Over the hike, this proved to be an underestimation. He was a great guide: always excited and having fun, but serious when he needed to be.\n\n<figure>\n<img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/bruno.jpg\" \/>\n<figcaption>Bruno, in a quiet moment.<\/figcaption>\n<\/figure>\n\nI wish they had brought an example foam pad and sleeping bag (which we were renting from them) so we could see what we were getting. Especially the foam pad, because Nelly suggested that we might want to rent self-inflating pads as well for comfort. We  decided to make that call once we could see what the equipment was the next day.\n\nNelly and Bruno then went to each person's room and went over every piece of gear we were bringing. This took forever: at least two hours. My Dad and I were near last so they didn't spend too much time with us; I think they were worn out. Also, the gear couldn't weigh more than 15 Kg. My duffle bag (the one being carried by a porter) weighed 13 Kg.\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/union-cafe.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/union-cafe-thumb.jpg\" \/><\/a>\n<figcaption>Union Cafe<\/figcaption>\n<\/figure>\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/guard.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/guard-thumb.jpg\" \/><\/a>\n<figcaption>The guards keep solicitors at bay.<\/figcaption>\n<\/figure>\n\nAfter, we went to lunch with Bruno at the Union Cafe. This was also a nice place not frequented by locals. Heck, there was a caucasian computer neckbeard type there on his Mac laptop. Unexpected. This place (like one of the souvenir shops yesterday) had armed guards at it. I'm not sure what their intended purpose is, but they kept solicitors away which was nice. Out of curiosity, I had a pizza. It wasn't bad, but the crust was almost like naan.\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/union-lunch.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/union-lunch-thumb.jpg\" \/><\/a>\n<figcaption>It might be advertised and look like Hawaiian Pizza, but looks can be deceiving.<\/figcaption>\n<\/figure>\n\nI should mention: Coke OWNS this town. You might notice in some of the pictures that many signs have Coke logos on them. When we took the bus to Machame gate, I saw that some street signs were \"Coke red\" and had the logo. I suspect Coke gives the signs away for free with the establishment's name painted on it. Everyone uses them. There were some places that had a cellphone carrier instead, but in Moshi Coke ruled.\n\n<figure>\n<img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/soda.jpg\" \/>\n<figcaption>Mmmmmmm... Stoney!<\/figcaption>\n<\/figure>\n\nSpeaking of Coke, we had access to a variety of sodas, all in refillable bottles. Coke, various flavors of Fanta and Krest, and Stoney Tangawizy (my favorite). (All those are Coke products, BTW.) Tangawizy means Ginger in Swahili. It's a sweet-hot ginger ale rather like Blenheim ginger ale here in the U.S. There was also Coke Light (which is Diet Coke) though that wasn't everywhere. Heather found Pepsi products in Arusha, but was pretty much out of luck everywhere else.\n\n<figure>\n<img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/beer1-thumb.jpg\" \/>\n<figcaption>Kilimanjaro, official beer of the Roof of Africa.<\/figcaption>\n<\/figure>\n\nWe also had had plenty of beer! Kilimanjaro, of course, which we thought was pretty good. Bruno joked that we could \"climb the mountain\" upon return from the trek. Safari Lager and Serengeti Lager weren't as good. We had some other Serengeti once at the hotel which was darker and richer, but never found it again (even at the hotel).\n\nAfter lunch, I napped. Craig, his Dad, and Kat went to Amani Children's Home to give our donations. I also repacked all my stuff (since we had to unpack everything for them to see it).\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/amani-front.jpg\" \/>\n<img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/amani-front-thumb.jpg\" \/><\/a>\n<figcaption>Amani Centre for Street Children<\/figcaption>\n<\/figure>\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/amani-school.jpg\" \/>\n<img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/amani-school-thumb.jpg\" \/><\/a>\n<figcaption>Schoolroom at Amani<\/figcaption>\n<\/figure>\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/amani-play.jpg\" \/>\n<img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/amani-play-thumb.jpg\" \/><\/a>\n<figcaption>Playground at Amani<\/figcaption>\n<\/figure>\n\nWe went to dinner with Bruno at the Indo-Italiano, which is exactly what it sounds like. They have two menus: one for Indian food and one for pasta. Both were really good. This place had a mix of tourists, expats, and local-ish people. We took a cab home. (Bruno said it wasn't safe; though we had walked basically the same thing the previous night with no fearsome moments.)\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/indoitaliano.jpg\" \/>\n<img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/indoitaliano-thumb.jpg\" \/><\/a>\n<figcaption>Bruno climbing the mountain at the IndoItaliano<\/figcaption>\n<\/figure>\n\nThe next morning we were to depart at 7:30am, so we settled our room charges. As I mentioned before, the Panama gave a very reasonable exchange rate and we paid in U.S. dollars. We also packed all our stuff up; trek into one duffle, leftovers and safari stuff in my suitcase, and hike stuff in my daypack.\n\nI was pretty excited to finally be so close to actually going on the trek. Luckily, dinner and jetlag put me to sleep pretty quickly.\n\n",
    "id":"20111002_9_212703",
    "link":"",
    "publishedDate":"2011-10-02T21:27:03+00:00",
    "source":"foamtotem",
    "title":"Kilimanjaro: Orientation",
    "via":"",
    "~orig":
        {
        },
    "~orig.728337349_222596554466176":
        {
            "actions":
                [
                    
                    {
                        "link":"http:\/\/www.facebook.com\/728337349\/posts\/222596554466176",
                        "name":"Comment"
                    },
                    
                    {
                        "link":"http:\/\/www.facebook.com\/728337349\/posts\/222596554466176",
                        "name":"Like"
                    }
                ],
            "application":
                {
                },
            "caption":"foamtotem.org",
            "comments":
                {
                    "data":
                        [
                            
                            {
                                "can_remove":"1",
                                "created_time":"2011-10-03T02:07:51+0000",
                                "from":
                                    {
                                        "id":"100000449847369",
                                        "name":"Carol Kuhn"
                                    },
                                "id":"728337349_222596554466176_2423032",
                                "message":"Pizza????"
                            },
                            
                            {
                                "can_remove":"1",
                                "created_time":"2011-10-04T04:17:33+0000",
                                "from":
                                    {
                                        "id":"1554010659",
                                        "name":"Donna Peronace"
                                    },
                                "id":"728337349_222596554466176_2428304",
                                "message":"This is great Poz!  I'm really enjoying reading your blog."
                            }
                        ]
                },
            "created_time":"2011-10-02T23:55:21+0000",
            "description":"Wherein we meet up with our guide, Bruno, and drink some beer.",
            "from":
                {
                    "id":"728337349",
                    "name":"Shannon Posniewski"
                },
            "icon":"https:\/\/s-static.ak.facebook.com\/rsrc.php\/v1\/yR\/r\/23eNFy_VOig.gif",
            "id":"728337349_222596554466176",
            "likes":
                {
                    "count":3,
                    "data":
                        [
                            
                            {
                                "id":"1554010659",
                                "name":"Donna Peronace"
                            },
                            
                            {
                                "id":"770382751",
                                "name":"Jennifer Jumper"
                            },
                            
                            {
                                "id":"1134692210",
                                "name":"Shelley Day Posniewski"
                            }
                        ]
                },
            "link":"http:\/\/www.foamtotem.org\/2011\/20111002_9_212703.html",
            "message":"We get oriented, have some pizza, and \"climb the mountain\" (though not literally).",
            "name":"Kilimanjaro: Orientation",
            "picture":"https:\/\/s-external.ak.fbcdn.net\/safe_image.php?d=AQAq110uQ5dIUWpN&w=90&h=90&url=http%3A%2F%2Ffoamtotem.org%2Fdaily%2Fimages%2Fkili%2Fbruno.jpg",
            "privacy":
                {
                    "allow":"0",
                    "deny":"0",
                    "description":"Friends of Friends",
                    "value":"FRIENDS_OF_FRIENDS"
                },
            "type":"link",
            "updated_time":"2011-10-04T04:17:33+0000"
        }
}