{
    "comments":
        {
            "data":
                [
                    
                    {
                        "can_remove":"1",
                        "created_time":"2011-10-01T04:30:40+0000",
                        "from":
                            {
                                "id":"711512803",
                                "name":"Laurie Stillwell"
                            },
                        "id":"728337349_228409903881929_2759871",
                        "message":"You always had a great smile. What an accomplishment."
                    }
                ]
        },
    "content":"\nWhen Craig, Kat, and I arrived at San Francisco airport, our flight was delayed an hour. We had just short of an hour for our layover in Amsterdam, but figured that we'd make up time in the air. The flight itself was uneventful. KLM has entertainment systems at each seat which helps a lot.\n\nWe did not make up much if any time, however, and when we got off the plane we high-tailed it to our next flight. Kat thought it was unfair that Craig and I had long legs as we nearly ran through the terminal. We made it, just barely, to the Amsterdam flight and met up with the rest of the crowd on the plane itself. (Most of us were seated near each other.)\n\nThe trip from Amsterdam to Kilimanjaro airport was also mostly uneventful. It's nearly as long as the trip from SFO to AMS, but is North-South rather than West-East. A bit before landing, I realized that it was the first time I had ever been south of the equator.\n\nWe got off the plane (down stairs; I always feel like the Beatles or Nixon when I go down stairs from a plane) and crammed into the hot and crowded immigration area to get our visas. The airport reminded my of the old Albany airport terminal. It has one runway, and no taxi lanes. You land, U-turn, and travel back down the runway to the terminal.\n\n<figure><a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/getting-visas.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/getting-visas-thumb.jpg\" \/><\/a>\n<figcaption>Happy to be on the ground!<\/figcaption>\n<\/figure>\n\nIf you are traveling to Tanzania, you can get your visa right there in the airport. We had read a variety of different requirements online for what we needed to bring. When we passed through, all we needed was our U.S.A. passports and $100 US. They didn't care about Yellow Fever immunizations since we're from the U.S. That said, there was an immunization office there and trust me when I say that you do NOT want to get your shot there. We didn't need any extra passport photos or anything. They scanned our passports, took our fingerprints (electronically) and that was it.\n\nDo make sure you get in the visa line when you get into the terminal. It's one big gaggle of people for both normal (post-visa) entry and to get your visa. The visa is on the right (along with a doorway that leads to the restrooms).\n\nThrough immigration, we picked up our luggage. Well, most of it. Those of us who ran to the plane didn't get theirs. There is one plane a day from Amsterdam, so our luggage would be a day late. Luckily, we added in an extra day just in case something like this happened.\n\nWe met Nelly and Ursula from Ahsante, who brought us out to their bus. On the way, many overly helpful people descended upon us to help with our bags. They were quite forceful in their desire to help us. Jenn had changed some money in the airport and after a bit of a scuffle with an overly-generous tip we sent them their way.\n\n<figure><a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/shillings.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/shillings.jpg\" \/><\/a>\n<figcaption>Tanzanian shillings<\/figcaption>\n<\/figure>\n\nThat brings up the topic of tipping and money in general. Tanzanian shillings are the currency of Tanzania, but nearly everyone will happily take U.S. dollars at various exchange rates. When our trip started, 1 USD was roughly worth around 1,500 TSh. Many places simply drop the hundreds digits, so if something costs 3500 TSh, it would be 3 USD. This is not a very good exchange rate, but most things are pretty cheap (unless you're being taken, which we were on several occasions). An appropriate tip for most simple things is 1 USD or 1,000 TSh (which is a single bill). So, a buck a bag seemed to be the norm.\n\nThe guidebook suggested that Tanzanians would only take our \"new money\" with big heads and recent dates. This is true with the exception of ones, which they took without looking at really. I hadn't brought any, which would have been  problematic if my Dad hadn't done so. Getting change is not guaranteed even for shillings; getting change for USD was very rare. The hotel we stayed at (the Panama) gave us a great exchange rate, however. We charged everything to our rooms, and then settled up in USD when we left.\n\nThough some money was exchanged in the airport, the rest of the shillings came from ATMs. Finding an ATM in Moshi was a bit touch and go. We did find one that was pretty consistently operational (I think it was the Barclay's).\n\nWe did a lot as a group, so we decided to have basically one person pay for things (dinners and so on) and settle up after we return to the U.S. There were some exceptions to this, but I think it worked out well on the whole. \n\n<figure><a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/panama-hotel.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/panama-hotel-thumb.jpg\" \/><\/a>\n<figcaption>Moshi from the balcony of our hotel.<\/figcaption>\n<\/figure>\n\nSo, Nelly and Ursula met us and shuttled us the 45 minutes to our hotel in Moshi. This was the first time we got to meet Nelly, who was the person we did all of our planning with via email. They were both very nice, which was a hallmark of our dealings with Ahsante. Let me just say now that even as Americans go some of us in the group can get uptight and OCD about things and they were able to handle it well.\n\nWe got our rooms, and basically turned in for the night. The Panama is a fairly modern hotel: en-suite bathrooms, western toilets, A\/C, and televisions. (Televisions seemed pretty rare overall.) They had wifi in their lounge\/dining room and their own kitchen.\n\nSo, as we're unpacking our bags and getting ready for bed, the lights went out. In all of Moshi. They came back on after a few minutes. Power is not reliable in Tanzania. In fact, it went out once or twice every day, though not for very long.\n\nEven though we had been in Tanzania for a few hours and drove across it for 45 minutes, we still hadn't seen anything because it was still dark. We would actually see Moshi for the first time in the morning.",
    "id":"20110930_9_221743",
    "link":"",
    "publishedDate":"2011-09-30T22:17:43+00:00",
    "source":"foamtotem",
    "title":"Kilimanjaro: Arrival",
    "via":"",
    "~orig":
        {
        },
    "~orig.728337349_228409903881929":
        {
            "actions":
                [
                    
                    {
                        "link":"http:\/\/www.facebook.com\/728337349\/posts\/228409903881929",
                        "name":"Comment"
                    },
                    
                    {
                        "link":"http:\/\/www.facebook.com\/728337349\/posts\/228409903881929",
                        "name":"Like"
                    }
                ],
            "application":
                {
                },
            "caption":"foamtotem.org",
            "comments":
                {
                    "data":
                        [
                            
                            {
                                "can_remove":"1",
                                "created_time":"2011-10-01T04:30:40+0000",
                                "from":
                                    {
                                        "id":"711512803",
                                        "name":"Laurie Stillwell"
                                    },
                                "id":"728337349_228409903881929_2759871",
                                "message":"You always had a great smile. What an accomplishment."
                            }
                        ]
                },
            "created_time":"2011-10-01T03:02:31+0000",
            "description":"Wherein our heroes land south of the equator.",
            "from":
                {
                    "id":"728337349",
                    "name":"Shannon Posniewski"
                },
            "icon":"https:\/\/s-static.ak.facebook.com\/rsrc.php\/v1\/yD\/r\/aS8ecmYRys0.gif",
            "id":"728337349_228409903881929",
            "likes":
                {
                    "count":2,
                    "data":
                        [
                            
                            {
                                "id":"1134692210",
                                "name":"Shelley Day Posniewski"
                            },
                            
                            {
                                "id":"1661085968",
                                "name":"Melissa Bourgeois"
                            }
                        ]
                },
            "link":"http:\/\/www.foamtotem.org\/2011\/20110930_9_221743.html",
            "message":"More of my trip to Tanzania.",
            "name":"Kilimanjaro: Arrival",
            "picture":"https:\/\/s-external.ak.fbcdn.net\/safe_image.php?d=AQC55DrtYoD_edLT&w=90&h=90&url=http%3A%2F%2Ffoamtotem.org%2Fdaily%2Fimages%2Fkili%2Fgetting-visas-thumb.jpg",
            "privacy":
                {
                    "allow":"0",
                    "deny":"0",
                    "description":"Friends of Friends",
                    "value":"FRIENDS_OF_FRIENDS"
                },
            "type":"link",
            "updated_time":"2011-10-01T04:30:40+0000"
        }
}