{
    "content":"I'm putting the final touches on my changes to Foam Totem. Of course, the very first attempt to comment on my last post failed (for everyone) because I didn't test posts that originated on Foam Totem and were then cross-posted to Facebook. I've fixed that now, as far as I know. In addition, the post is checked to make sure it's actually on Facebook somewhere before I try to send the comment there. (If it's not on Facebook, the comment is saved just on Foam Totem.)\n\nI've made dozens of cleanup changes from simple code polish to finding and removing detritus and other temporary files that were left around. And, now that I basically finished all the dangerous work, I put it all into revision control. There were probably two occasions when I wish I had done so earlier.\n\nI cleaned up the Atom feed once again. I removed my daily run from the feed because it seemed noisy (if you prefer it back in there, let me know). I added some better heuristics for building titles that don't entirely suck.\n\n<i style=\"text-align:center; display:block\">Welcome to the NUEVO MUNDO!<\/i>\n<img src=\"http:\/\/foamtotem.org\/daily\/images\/nuevo-mundo.png\" class=\"posterous\" width=\"558\" height=\"386\" \/>\n<i style=\"text-align:center; display:block\">See? You're much less bored now!<\/i>\n\nThe only remaining thing I might tackle is making a better map for Runmeter. Their maps are pretty good, but I've been wanting a map which colors the route depending on how fast I'm running. (So, it might be red where I stop, and green when I'm going fast.) I've done the fiddly parts of this already (e.g. dereferencing the short URL to find the KML file). The next thing to do would be to copy it locally and use Perl to frob the file to manufacture a colored path. The data is already in there, but not currently in a place Google Maps can get to it.\n\nIt's been pretty stable today as I've been exercising it. I wonder if this version of the code will last as long as the last one (which was around 8 years). If Facebook changes its API or its data schema, that stuff won't work any more but everything else still should.\n\n(This post is more to mark when this code was done that it is to amuse or delight the reader. I don't expect to post many more of these. From here on out it will be all amusement and delightfulness!)",
    "id":"20110508_9_023655",
    "link":"",
    "publishedDate":"2011-05-08T02:36:55+00:00",
    "source":"foamtotem",
    "title":"Foam Totem Connect Update",
    "via":""
}