{
    "comments":
        {
            "data":
                [
                    
                    {
                        "can_remove":"1",
                        "created_time":"2011-10-05T02:40:21+0000",
                        "from":
                            {
                                "id":"1554010659",
                                "name":"Donna Peronace"
                            },
                        "id":"728337349_237937672921554_2888093",
                        "message":"Thanks for sharing all this Poz."
                    },
                    
                    {
                        "created_time":"2011-10-05T04:11:30+00:00",
                        "from":
                            {
                                "id":"74.58.133.148",
                                "name":"Anne"
                            },
                        "id":"20111004_9_161712_20111005_8_041130",
                        "message":"Poa!"
                    },
                    
                    {
                        "can_remove":"1",
                        "created_time":"2011-10-05T11:41:55+0000",
                        "from":
                            {
                                "id":"770382751",
                                "name":"Jennifer Jumper"
                            },
                        "id":"728337349_237937672921554_2889467",
                        "message":"don't forget all the business signs with the red X.....:)"
                    }
                ]
        },
    "content":"\nAs I re-read my previous entries, I realized that I didn't give much feel for what Tanzania is like. So, before I jump to the actual trek, I wanted to try and give a few thoughts about what the Kilimanjaro area of Tanzania is like.\n\n<figure>\n<img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/tanzania-map.jpg\" \/>\n<figcaption>Tanzania (based on the map <a href=\"http:\/\/www.africa-adventure.com\/map\/tanzania\">here<\/a>)<\/figcaption>\n<\/figure>\n\n<a href=\"http:\/\/en.wikipedia.org\/wiki\/Tanzania\">Tanzania<\/a> is located south of the horn of Africa, on the east coast of the continent. It's approximately the size of Egypt. It sits just south of the Equator, so the days and nights are each almost exactly 12 hours long. I expected it to be blazing hot, but it wasn't really while we were there. If you stood in the sun at noon, you'd get hot but the air never seemed to get crazy hot. We were there in the drier part of the year, and it was very dry and dusty.\n\nKilimanjaro is in northeastern Tanzania, right on the border between Tanzania and Kenya. (According to our guides, there was some kind of dispute over Kili and the Serengeti between the nations and Tanzania prevailed. You still cannot enter the Serengeti from Kenya.) We stayed in Moshi, climbed Kilimanjaro, and then traveled west on safari through Arusha, through Ngorongoro, and to the Serengeti. I've marked on the map places we stayed as red dots and places we drove to as blue dots. So, we covered quite a bit of ground. (And everything after Ngorongoro was on unpaved roads.)\n\nTanzania is \"developing nation\", which means that a lot of things we take for granted aren't always found. I mentioned before that constant electric power isn't a given even in the larger towns and cities. Most roads aren't paved. Agriculture is not very mechanized (the fields I saw weren't navigable with anything bigger than a small tractor). Foreigners would do well to avoid drinking non-bottled water. But the thing that I noticed the most was how ad hoc everything seemed to be.\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/adhoc.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/adhoc-thumb.jpg\" \/><\/a>\n<figcaption>Typical construction<\/figcaption>\n<\/figure>\n\nWe're used to buildings being fairly standardized. There's all sorts of rules and inspections and that sort of thing. The towns we passed were clearly not created with any kind of building code in mind. They were built with what was available to support whatever it is they were built for. (Though I should mention that hotels we stayed at and public places we went to all felt like they were \"to code\".)\n\nIn Moshi (and in most towns we passed by), the streets and walks were kept pretty clean. (There were a couple exceptions). In Moshi, there were places where the sidewalk was missing and there was just dirt packed. The dirt path was swept clear every morning.\n\nCommerce is also a bit old-school and random. I mentioned being harassed by solicitors (\"touts\") already. Very few things have a fixed price, so one needs to haggle, which I'm not used to doing and leads to buyers remorse pretty much all the time. (Though food and drink have set prices from what I could tell.) You aren't always guaranteed that you can get proper change, so it pays to have a mix of denominations available. Not all waiters and salespeople are adept at sums. (I've had them come out high and low, so not everyone was trying to get a bit of extra cash.) It seemed like some people preferred US dollars to Tanzanian shillings, but at the same time gave very bad exchange rates.\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/serengeti-road.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/serengeti-road-thumb.jpg\" \/><\/a>\n<figcaption>Fixing a flat on the main road through the Serengeti. Don't see the road? Click for a bigger version.<\/figcaption>\n<\/figure>\n\nOne gets very dirty when one travels in Tanzania. It's an aspect of travel we no longer experience much in America. Practically all our roads are paved. When one travels by air, one doesn't even go outside to get on the plane any more. I can understand how dirty people must have gotten by simply traveling town to town in pre-paved America. I can hardly imagine how it was during the western expansion.   During our safari, we were met at the lodge with a damp washcloth and a glass of fruit juice. Very posh, I know. I was surprised at how much dirt my face and neck collected.\n\nOn Kilimanjaro, I expected to get pretty dirty but I was shocked at how absolutely filthy I got. The dirt is volcanic dust and got everywhere and in everything. I was still removing it from under my fingernails after I returned to the U.S. That's another reminder for trekkers to pack in plastic bags.\n\n<figure><iframe width=\"560\" height=\"315\" src=\"http:\/\/www.youtube.com\/embed\/uRRyAEddO6E?rel=0\" frameborder=\"0\" allowfullscreen><\/iframe>\n<figcaption>You will hear this in Tanzania. A lot. (Our porters replaced \"Kenya yetu\" with \"Kilimanjaro\")<\/figcaption>\n<\/figure>\n\nOne Swahili phrase we heard a lot was \"pole-pole\", which means \"slowly\". This is the refrain of Kilimanjaro guides, which have to work to keep people moving slowly enough up the mountain. Rising slowly is better for acclimatization. You'll hear it a lot if you trek up the mountain. In addition, just about everything else in Tanzania is pole-pole too, compared to our much more impatient western world. Expect dinner (if there's more than a couple of you) to take a while to come out, for example.\n\nAnother very common phrase is \"hakuna matata\", meaning \"no worries\". Apparently <i>The Lion King<\/i> made it known internationally. I have never seen it, so I remain blissfully unaware of the tune. It's a good response to westerners who are expecting haraka-haraka (fast) and getting pole-pole. It seems to be used as a mixture between \"no worries\", \"relax\", and \"hang loose\".\n\nIf you go to Tanzania, you are likely to pick up some Swahili words, but mainly for the fun of it. You'll greet porters and passers-by with \"Jambo!\" (\"Hello!\") and learn to respond to \"mambo\" (\"How goes?\") with \"poa\" (\"Cool\"). English is spoken by everyone we met in varying degrees. It's taught as a second language in primary school, and as a primary language in secondary school. Until recently, it was the official language of the courts. I never had too hard a time making myself understood, though there were occasional hiccups with idiom and certain kinds of questions.\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/guides-window.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/guides-window-thumb.jpg\" \/><\/a>\n<figcaption>Rufano, Pascal, and Bruno giving us a dose of hakuna matata.<\/figcaption>\n<\/figure>\n\nI found the vast majority of people I met in Tanzania to be very welcoming and helpful. I'm sure that I looked like a walking pile of cash to some people, but even so I rarely felt like the people weren't genuinely kind and open. (One notable exception might be in the souvenir shop where I felt instead like they were trying to screw me over, which they did.) Our porters and guides were really great: not just competent, but fun, engaging, and inclusive. I felt the same sort of vibe throughout our trip.\n\n",
    "id":"20111004_9_161712",
    "link":"",
    "publishedDate":"2011-10-04T16:17:12+00:00",
    "source":"foamtotem",
    "title":"Kilimanjaro: Tanzania",
    "via":"",
    "~orig":
        {
        },
    "~orig.728337349_237937672921554":
        {
            "actions":
                [
                    
                    {
                        "link":"http:\/\/www.facebook.com\/728337349\/posts\/237937672921554",
                        "name":"Comment"
                    },
                    
                    {
                        "link":"http:\/\/www.facebook.com\/728337349\/posts\/237937672921554",
                        "name":"Like"
                    }
                ],
            "application":
                {
                },
            "caption":"foamtotem.org",
            "comments":
                {
                    "data":
                        [
                            
                            {
                                "can_remove":"1",
                                "created_time":"2011-10-05T02:40:21+0000",
                                "from":
                                    {
                                        "id":"1554010659",
                                        "name":"Donna Peronace"
                                    },
                                "id":"728337349_237937672921554_2888093",
                                "message":"Thanks for sharing all this Poz."
                            },
                            
                            {
                                "can_remove":"1",
                                "created_time":"2011-10-05T11:41:55+0000",
                                "from":
                                    {
                                        "id":"770382751",
                                        "name":"Jennifer Jumper"
                                    },
                                "id":"728337349_237937672921554_2889467",
                                "message":"don't forget all the business signs with the red X.....:)"
                            }
                        ]
                },
            "created_time":"2011-10-05T02:29:59+0000",
            "description":"As I re-read my previous entries, I realized that I didn't give much feel for what Tanzania is like.",
            "from":
                {
                    "id":"728337349",
                    "name":"Shannon Posniewski"
                },
            "icon":"https:\/\/s-static.ak.facebook.com\/rsrc.php\/v1\/yR\/r\/23eNFy_VOig.gif",
            "id":"728337349_237937672921554",
            "likes":
                {
                    "count":1,
                    "data":
                        [
                            
                            {
                                "id":"1134692210",
                                "name":"Shelley Day Posniewski"
                            }
                        ]
                },
            "link":"http:\/\/www.foamtotem.org\/2011\/20111004_9_161712.html",
            "message":"You might have thought the next post would be about the actual hike...",
            "name":"Kilimanjaro: Tanzania",
            "picture":"https:\/\/s-external.ak.fbcdn.net\/safe_image.php?d=AQCVLHTP7i0zRqP6&w=90&h=90&url=http%3A%2F%2Ffoamtotem.org%2Fdaily%2Fimages%2Fkili%2Ftanzania-map.jpg",
            "privacy":
                {
                    "allow":"0",
                    "deny":"0",
                    "description":"Friends of Friends",
                    "value":"FRIENDS_OF_FRIENDS"
                },
            "type":"link",
            "updated_time":"2011-10-05T11:41:55+0000"
        }
}