{
    "comments":
        {
            "data":
                [
                    
                    {
                        "can_remove":"1",
                        "created_time":"2011-10-07T05:08:28+0000",
                        "from":
                            {
                                "id":"1554010659",
                                "name":"Donna Peronace"
                            },
                        "id":"728337349_105678962875786_19713",
                        "message":"This is great Poz.  I like the way you write."
                    },
                    
                    {
                        "can_remove":"1",
                        "created_time":"2011-10-07T10:23:10+0000",
                        "from":
                            {
                                "id":"1661085968",
                                "name":"Melissa Bourgeois"
                            },
                        "id":"728337349_105678962875786_20384",
                        "message":"I am thoroughly enjoying theses reads and look forward to the next...you are a born author!"
                    },
                    
                    {
                        "can_remove":"1",
                        "created_time":"2011-10-07T12:20:00+0000",
                        "from":
                            {
                                "id":"770382751",
                                "name":"Jennifer Jumper"
                            },
                        "id":"728337349_105678962875786_20667",
                        "message":"you started it: yes, i will never hike (or travel, depending on location...) without that device again.....:)"
                    },
                    
                    {
                        "created_time":"2011-10-07T12:49:25+00:00",
                        "from":
                            {
                                "id":"97.65.146.51",
                                "name":"Michelle (Giroux) Zeller"
                            },
                        "id":"20111006_9_235243_20111007_8_124925",
                        "message":"Poz - Absolutely amazing! You make me want to visit & try it myself! I look forward to your additional posts. (PS: You DID bring your sax, right?!!? A little tune for everyone at the top? :-)"
                    },
                    
                    {
                        "can_remove":"1",
                        "created_time":"2011-10-07T22:53:31+0000",
                        "from":
                            {
                                "id":"100000266633627",
                                "name":"Barbara Vorce"
                            },
                        "id":"728337349_105678962875786_22695",
                        "message":"What a great story Shannon.  Very impressed."
                    },
                    
                    {
                        "created_time":"2011-10-08T02:18:21+00:00",
                        "from":
                            {
                                "id":"71.181.39.200",
                                "name":"Frodo"
                            },
                        "id":"20111006_9_235243_20111008_8_021821",
                        "message":"In my defense, Rufano kept exhorting us to kunywa maji!  There was no way I was going to get dehydrated."
                    },
                    
                    {
                        "can_remove":"1",
                        "created_time":"2011-10-09T00:58:11+0000",
                        "from":
                            {
                                "id":"728337349",
                                "name":"Shannon Posniewski"
                            },
                        "id":"728337349_105678962875786_27499",
                        "message":"More coming soon!"
                    }
                ]
        },
    "content":"Finally, the day to actually start the trek had arrived. Ahsante showed up in the morning with their bus to take us and all our stuff. A short ride later and we were at the Ahsante offices to drop off our unneeded luggage. Things we weren't bringing up the mountain (for example, safari clothes) would be kept locked up there.\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/bus.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/bus-thumb.jpg\" \/><\/a>\n<figcaption>The Ahsante bus<\/figcaption>\n<\/figure>\n\nAt this point we saw what the sleeping pads were like and everyone but Dan (of course) decided to rent the second mattress. The first, provided pad was your run-of-the-mill closed-cell foam mattress. The one we rented was a self-inflating mattress. We would have two each, then. The closed-cell one and a squishier one.\n\nHowever, a significant issue had come up previously. Jenn asked what we thought about paying for a porter to bring up a porta-potty. The privies\/outhouses at the camps are not known for their cleanliness. They are almost all \"long-drop\" privies. That means no seat; you squat and go. This isn't an uncommon set-up in Africa (and many other countries) for standard rest rooms. (Both Western-style toilets and long-drops were available at several restrooms we used in town.) There are also a limited number of privies at each camp, and it's a pretty busy mountain. There might be lines.\n\nWe had briefly discussed it in email beforehand. The consensus was that \"we didn't care.\" Most of us are guys and stand up for half of our \"business\" anyway. This result was taken (not too surprisingly) as a no. We actually meant that it would be fine with us; we had no strong opinion on the matter. When Jenn realized this, she jumped at the chance to have one brought for us. What we found may be the most fact you learn from reading this whole series:\n\n<br>\n<p><center><b>YOU WANT TO RENT A TOILET.<\/b><\/center><\/p>\n<br>\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/tentapotty.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/tentapotty-thumb.jpg\" \/><\/a>\n<figcaption>The Tentapotty<\/figcaption>\n<\/figure>\n\nThe privies are something you do not want to step into, mainly because tourists use them and don't know how to aim for the hole. And then they don't clean up their accidents. It's quite awful and you want to avoid them. (Though there were lines, they were usually not more than a couple people.)\n\nSince I've just spent three paragraphs on evacuation, I may as well tell you everything. Pictured is what we called the \"tentapotty\" (or as our guide called it, the \"internet cafe\") in all its glory. The commode itself operates much like a head on a boat. You sit on the commode and do your business. You clean up with TP, and the TP goes into the blue bag that you see hanging up on the right. (The white bag on the ground has fresh TP and cleaning supplies in it.) You close the lid, pump a handle a couple times which provides water that cleans the bowl. You then pull a lever on the front which opens a trap door that drops the waste and dirty water into the sump. Each day, a porter empties the commode into one of the privies. (When we hand out tips, BTW, the toilet porter is in his own pay class. We tipped him well.)\n\nLastly, I have it on good authority that the women were happy to have bought \"she-wee\"s. These are devices which allow ladies to urinate standing up. (I've been told that one should practice at home before using one on the trail, however.) Taking our cue from the porters, we didn't use the privies for \"number one\", in general. We found a rock or tree. Dan seemed to need rocks or trees every 100 yards.\n\nMy goodness, who would have guessed that I would write so much on waste removal?\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/machame-gate.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/machame-gate-thumb.jpg\" \/><\/a>\n<figcaption>The well-rested and clean crew at Machame Gate<\/figcaption>\n<\/figure>\n\nAnd so we were brought to Machame Gate, signed in, and actually began the trek. As mentioned before, the Machame route is nice because it's a bit more picturesque than the other routes. It travels through several different climates, beginning here with rain forest. Machame is also longer than other routes so you rise more slowly, providing better and easier acclimatization to the altitude.\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/route-rules.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/route-rules-thumb.jpg\" \/><\/a>\n<figcaption>The route, and some points to remember<\/figcaption>\n<\/figure>\n\nWe started off with Rufano (our other guide) in the lead. Bruno was settling up the porters, permits, and the like. The trail begins and is actually paved for a while until it turns into a wide dirt road. Of course, the trail is uphill and insistently so. (You should always assume so unless I say differently, by the way.) The road turns into a trail and becomes a bit more steep.\n\nRufano set a difficult pace; difficult because it was very slow. Imagine going a lot slower than a normal hike. No, even slower than that. A touch more... yeah. That's about the speed. It felt like doing isometric exercises. We averaged about 1.5 miles an hour this day, which is about half the speed that Craig and I hiked with Chris during the summer. (We went even slower as the trip progressed.)\n\nIt was quite steep. I'd guess around a 10% grade. Kat's knee started giving her a lot of trouble and she was in quite a lot of pain by the end of the day. I thought her knee was done for, but there wasn't much to do about it but drown it in ibuprofen. In the morning she'd decide whether to keep going or turn back.\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/machame-trail.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/machame-trail-thumb.jpg\" \/><\/a>\n<figcaption>On the trail to Machame Hut<\/figcaption>\n<\/figure>\n\nAfter some time, porters started to pass us. This happened every day. We would set off right after breakfast and they would catch up and pass us along the way. Porters carry all the camp gear (tents, stoves, food, fuel, etc), our duffle bags, and their own gear as well. In all, they carry between 45 and 55 pounds up the mountain. Remember, our duffle bags are allowed to be as much as 33 pounds (15kg). They carry most of this weight on their heads, as you can see here. Depending on the company, their gear isn't always very good. We saw more than a few porters (none of Ahsante's, as far as I know) going up the hill in sneakers that were barely hanging on their feet.\n\nIn our packs, we carried three or so liters of water, energy bars and other snacks, first aid stuff, sunblock, camera, rain gear, and maybe an extra jacket. Basic day pack sorts of things.\n\nWe went through the rain forest, seeing a lot of vegetation and also Kilimanjaro's own bright orange-red <a href=\"http:\/\/images.google.com\/search?q=impatiens+kilimanjari&hl=en&prmd=imvns&tbm=isch\"><i>Impatiens kilimanjari<\/i><\/a>. (Sadly, every picture we took of this flower was blurry.) Eventually, we stopped for lunch, where we had our first run-in with wretched toilets. (The tentapotty was generally available only at camp.) Lunch was cold chicken, a muffin, a fruit juice box, and other snacky sorts of things.\n\nAs we were finishing lunch, a few porters showed up and started setting up a table and chairs for another couple who soon arrived. This shows that you can certainly get a fancier trip up the mountain than we did. (We were sitting on tree stumps and the like.) To be honest, though, I think we chose the right level of fancy (with one exception that I will come to later).\n\nThe trees started to thin out, at first because they dropped off on both sides. The trail was along the spine between two cuts that dropped away pretty steeply.  Pretty soon, the trees started to thin out due to altitude; we were no longer in a rain forest.\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/machame-hut.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/machame-hut-thumb.jpg\" \/><\/a>\n<figcaption>Machame Hut<\/figcaption>\n<\/figure>\n\nSoon, we arrived at Machame Hut. This leg was around 6.5 miles and had a rise of nearly 4,000 feet. As was the case every day, the porters had gotten there before us and had set up camp. Our tents were set up and, as this was the first night, we chose them. My Dad and I got number 14. The tents were in great shape.  Half of it was the tent-proper, the other half was a floor-less vestibule where we could put our packs, duffles, and shoes.\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/machame-snack.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/machame-snack-thumb.jpg\" \/><\/a>\n<figcaption>Cookies and popcorn!<\/figcaption>\n<\/figure>\n\nAfter washing up a bit (they provided hot water and soap for us) we had a snack of cookies, popcorn, and hot drinks. The mess tent was the main communal area and also one of the most recognizable parts of our camp. On later days as we rolled into the camping area, it's what I would look for (perhaps because there was always a snack waiting for us).\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/machame-tents.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/machame-tents-thumb.jpg\" \/><\/a>\n<figcaption>Tent Number 14<\/figcaption>\n<\/figure>\n\nWe had a bit of free time (the only day where we had any, really). I walked around a little, Dan read a book, Craig painted in his journal, and I'm sure several people tested out the Internet Cafe (tentapotty). Though we couldn't see the peak during the hike, it was readily visible from the camp. It looked very far away.\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/machame-kili.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/machame-kili-thumb.jpg\" \/><\/a>\n<figcaption>Kili peak at sunset from Machame Hut<\/figcaption>\n<\/figure>\n\nWe had dinner at 6pm. It was a cucumber soup, beef curry, and peas. It was warm, hearty, and good. By the time dinner was over, it was fairly dark (sunset was at 6:30). I think most of us turned in by 8:30.\n\nAs I fell asleep, I remember thinking that I would almost definitely need to pee during the night. I mean, warm soup for dinner? Yeah. Gonna have to pee.\n\n<figure>\n<a href=\"https:\/\/picasaweb.google.com\/posniewski\/Machame?authuser=0&feat=directlink\">\n<img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/machame.jpg\" \/><\/a>\n<figcaption>Click here to see more photos from this part of the trip.<\/figcaption>\n<\/figure>\n",
    "id":"20111006_9_235243",
    "link":"",
    "publishedDate":"2011-10-06T23:52:43+00:00",
    "source":"foamtotem",
    "title":"Kilimanjaro: Machame Hut",
    "via":"",
    "~orig":
        {
        },
    "~orig.728337349_105678962875786":
        {
            "actions":
                [
                    
                    {
                        "link":"http:\/\/www.facebook.com\/728337349\/posts\/105678962875786",
                        "name":"Comment"
                    },
                    
                    {
                        "link":"http:\/\/www.facebook.com\/728337349\/posts\/105678962875786",
                        "name":"Like"
                    }
                ],
            "application":
                {
                },
            "caption":"foamtotem.org",
            "comments":
                {
                    "data":
                        [
                            
                            {
                                "can_remove":"1",
                                "created_time":"2011-10-07T05:08:28+0000",
                                "from":
                                    {
                                        "id":"1554010659",
                                        "name":"Donna Peronace"
                                    },
                                "id":"728337349_105678962875786_19713",
                                "message":"This is great Poz.  I like the way you write."
                            },
                            
                            {
                                "can_remove":"1",
                                "created_time":"2011-10-07T10:23:10+0000",
                                "from":
                                    {
                                        "id":"1661085968",
                                        "name":"Melissa Bourgeois"
                                    },
                                "id":"728337349_105678962875786_20384",
                                "message":"I am thoroughly enjoying theses reads and look forward to the next...you are a born author!"
                            },
                            
                            {
                                "can_remove":"1",
                                "created_time":"2011-10-07T12:20:00+0000",
                                "from":
                                    {
                                        "id":"770382751",
                                        "name":"Jennifer Jumper"
                                    },
                                "id":"728337349_105678962875786_20667",
                                "message":"you started it: yes, i will never hike (or travel, depending on location...) without that device again.....:)"
                            },
                            
                            {
                                "can_remove":"1",
                                "created_time":"2011-10-07T22:53:31+0000",
                                "from":
                                    {
                                        "id":"100000266633627",
                                        "name":"Barbara Vorce"
                                    },
                                "id":"728337349_105678962875786_22695",
                                "message":"What a great story Shannon.  Very impressed."
                            },
                            
                            {
                                "can_remove":"1",
                                "created_time":"2011-10-09T00:58:11+0000",
                                "from":
                                    {
                                        "id":"728337349",
                                        "name":"Shannon Posniewski"
                                    },
                                "id":"728337349_105678962875786_27499",
                                "message":"More coming soon!"
                            }
                        ]
                },
            "created_time":"2011-10-07T04:26:29+0000",
            "description":"Finally, the day to actually start the trek had arrived. Ahsante showed up in the morning with their bus to take us and all our stuff.",
            "from":
                {
                    "id":"728337349",
                    "name":"Shannon Posniewski"
                },
            "icon":"https:\/\/s-static.ak.facebook.com\/rsrc.php\/v1\/yR\/r\/23eNFy_VOig.gif",
            "id":"728337349_105678962875786",
            "likes":
                {
                    "count":4,
                    "data":
                        [
                            
                            {
                                "id":"728337349",
                                "name":"Shannon Posniewski"
                            },
                            
                            {
                                "id":"1134692210",
                                "name":"Shelley Day Posniewski"
                            },
                            
                            {
                                "id":"770382751",
                                "name":"Jennifer Jumper"
                            },
                            
                            {
                                "id":"1554010659",
                                "name":"Donna Peronace"
                            }
                        ]
                },
            "link":"http:\/\/www.foamtotem.org\/2011\/20111006_9_235243.html",
            "message":"We start the hike! With a toilet!",
            "name":"Kilimanjaro: Machame Hut",
            "picture":"https:\/\/s-external.ak.fbcdn.net\/safe_image.php?d=AQDngYqEjk07heqI&w=90&h=90&url=http%3A%2F%2Ffoamtotem.org%2Fdaily%2Fimages%2Fkili%2Fmachame-gate-thumb.jpg",
            "privacy":
                {
                    "allow":"10150348324912350",
                    "description":"Everyone",
                    "friends":"SOME_FRIENDS",
                    "value":"CUSTOM"
                },
            "type":"link",
            "updated_time":"2011-10-09T00:58:11+0000"
        }
}