{
    "content":"\nFoam Totem has always been in a sort of limbo between a dirty, slimy hack and a well-considered and -behaved hack. I stepped into some of the slimy parts today. I kept all my dates and times in local time. In nearly all situations, this was fine. However, Facebook, Posterous, and Twitter all (wisely) stick to GMT. So as I started importing them, there was some friction which eventually required a fix rather than a patch. Ferreting out all the little inconsistencies in the code was a pain.\n\nRedoing the dates meant I had to regenerate all the JSON files back to the beginning of the year. (Which is easy to do.) I think I finally have the final data format, and I've set up the scripts to just update rather than blow away existing data.\n\nAlso in the hack category was using \"select\" to choose the output file and then just printing everything as if it was going to STDOUT. As soon as I wanted to emit a page for each item, this quick hack self-destructed. So I had to add a file handle parameter to everything. Wholesale API changes are dangerous because they make you review all the code, which often has a side effect of finding a couple things you want to touch up. And they tell two friends, and so on, and so on...\n\nI've added handling for Facebook links and videos now. I actually had the videos embedded, but they made the page layout look really random and crappy. If I get clever, I'll set it up so that clicking on the image will replace it with an embedded player. But not now. (And it'd only work for YouTube anyway.)\n\nI'm pretty happy with it now, and what I have should be able to handle the remainder of my plans without needing another cleansing. Although I'm generating individual pages for each post (click on the title of the post to go there), they still need the Open Graph stuff stuck into them. And after that, I'll start looking at comments.",
    "id":"20110422_9_084801",
    "link":"",
    "publishedDate":"2011-04-22T08:48:01+00:00",
    "title":"Wheel Keeps on Turning",
    "via":"my bloody fingers"
}