{
    "comments":
        {
            "data":
                [
                    
                    {
                        "can_remove":"1",
                        "created_time":"2011-10-15T17:01:24+0000",
                        "from":
                            {
                                "id":"1134692210",
                                "name":"Shelley Day Posniewski"
                            },
                        "id":"728337349_274422395925470_3898671",
                        "message":"I don't want these entries to end."
                    },
                    
                    {
                        "can_remove":"1",
                        "created_time":"2011-10-15T17:14:22+0000",
                        "from":
                            {
                                "id":"653106427",
                                "name":"Sarah Burns Feyl"
                            },
                        "id":"728337349_274422395925470_3898716",
                        "likes":1,
                        "message":"I got a little teary eyed reading this. How wonderful for you and your Dad to do this together. :-)",
                        "user_likes":"1"
                    },
                    
                    {
                        "can_remove":"1",
                        "created_time":"2011-10-15T20:42:36+0000",
                        "from":
                            {
                                "id":"100000070828265",
                                "name":"Mark Farrell"
                            },
                        "id":"728337349_274422395925470_3899565",
                        "likes":1,
                        "message":"Great picture of you and your dad!",
                        "user_likes":"1"
                    },
                    
                    {
                        "can_remove":"1",
                        "created_time":"2011-10-16T02:09:34+0000",
                        "from":
                            {
                                "id":"1554010659",
                                "name":"Donna Peronace"
                            },
                        "id":"728337349_274422395925470_3900643",
                        "likes":1,
                        "message":"What an amazing experience to have and to share with your Dad!  Your posts really give a sense of what it was like.  Thank you for sharing.",
                        "user_likes":"1"
                    },
                    
                    {
                        "created_time":"2011-10-16T02:24:11+00:00",
                        "from":
                            {
                                "id":"108.34.137.117",
                                "name":"Lon Chapman"
                            },
                        "id":"20111015_9_053632_20111016_8_022411",
                        "message":"I've done some hard treks but that was a hell of a grueling mountain to attain. I am full of envy and awe from following journey. Ya'll kick butt!"
                    },
                    
                    {
                        "can_remove":"1",
                        "created_time":"2011-10-16T03:50:51+0000",
                        "from":
                            {
                                "id":"100000449847369",
                                "name":"Carol Kuhn"
                            },
                        "id":"728337349_274422395925470_3900933",
                        "likes":1,
                        "message":"Shannon & Jim: Amazing! That summarizes all I can say. I will never complain about a blister ever, ever again. Or about being out of breath coming up  our pasture hill,  Thanks for your honest journals.",
                        "user_likes":"1"
                    },
                    
                    {
                        "created_time":"2011-10-19T22:56:32+00:00",
                        "from":
                            {
                                "id":"74.58.133.148",
                                "name":"Anne Thivierge"
                            },
                        "id":"20111015_9_053632_20111019_8_225632",
                        "message":"Like Donna said and Congradulation to all of you!"
                    }
                ]
        },
    "content":"\nI know we had dinner at Barafu, but I have no recollection of it. (As I mentioned, my journal has run dry.) We went to our tents until 10:30pm, when we were to start getting ready and have a snack.\n\nIt had been cold the previous nights, and some of the things Bruno said about it worried me, so I wore basically everything I had. I wore four layers of pants: tights, two pairs of pants, and my rain pants (for wind protection). I had 5 layers on my torso: long sleeve base layer, hooded pullover, fleece, synthetic down jacket, and a ski shell. Feet had sock liners and wool socks. Mittens for the hands. I brought along ski goggles and a facemask (which I did not need, thankfully). I also had a ski hat, but I used my hoods when needed instead.\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/barafu-night.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/barafu-night-thumb.jpg\" \/><\/a>\n<figcaption>The summit by moonlight from Barafu<\/figcaption><\/figure>\n\nIn my pack I had the standard 3L of water in the Camelback. I insulated it with an extra shirt and some crazy-heavy wool socks I had. I started a hand warmer and put it where the tube connected to the bag to try and head off freezing. I put several Clif bars and Gu in interior pockets (so they wouldn't freeze).\n\nWe met in the mess tent and had a snack. I recall popcorn, but there might have been porridge too. I honestly can't remember. Soon, we were gearing up to go. We would be taken up by Bruno and Rufano, of course, as well as two other porters. There were also porters assigned to a \"rescue crew\" who would come up and bring someone down if they needed to be brought down.\n\nThe Moon was out in near-full glory, and obviated the need for my headlamp entirely. The glaciers were clearly visible in the light, and one could easily make out the contours of the summit itself. Looking up the trail, we could see the bobbing lights of other hikers beginning their summit trek as well. It was silent and amazing.\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/barafu-jenn.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/barafu-jenn-thumb.jpg\" \/><\/a>\n<figcaption>Dark and Cold<\/figcaption><\/figure>\n\nWe started off, first tromping through the rest of Barafu Camp, and then scrambling up a cliff for a while. It leveled off a bit after this and we began the trudge up to Stella Point. Almost immediately, Bruno and Rufano juggled the order of our line, putting Dan and I at the back of the line. I'm not sure why, but it may have been because they wanted to keep a closer eye on others. The pace was very slow; slower than our previous days.\n\n(It's possible that I've gotten some of this narrative out of order. The hike  was dark, beautiful, cold, and long, so I may have mis-filed some of these memories. Apologies.) \n\nIt certainly was cold. My toes were a bit cold as we started out and I figured they would warm up. When drinking from the Camelbacks, it was important to blow some air back into the tube so it wouldn't freeze up. Even with the insulation, it would freeze pretty quickly. Jenn's and my Dad's both froze up fairly early on and shared with Dan and I.\n\nOnce we were over the cliff, Pascal (one of the summit guides) started quietly singing. Occasionally the other guides would join in. He sang various porter songs and random other stuff he knew-- even Christmas carols (in Swahili and Latin). He kept this up continuously for the entire trip up to Stella Point. Seven hours of singing. I'm indebted to him for this, because otherwise I may very likely have gone insane from the monotony.\n\nWe got to the ridgeline seen all along our walk from Karanga to Barafu and walked along behind it. Kat started having some problems breathing. She had been fighting a minor chest cold the previous couple days, but now it was keeping her from getting much air. Eventually, she had to stop and take a break. Rufano stayed behind with her while she recovered and we kept on.\n\nWe were doing switchback after switchback, slowly moving up the mountain. Being right on it meant that we really couldn't see our eventual destination any more, but there were still the occasional bobbing lights ahead of us on the trail. I looked back several times and could see Kat and Rufano's light as they continued on behind us.\n\n<figure><figcaption>It was dark out, so I don't have any pictures.<\/figcaption><\/figure>\n\nThough my toes were a bit cold, I was otherwise hotter than blazes. I had overdressed significantly. I had unzipped everything I could a while ago, but I was worried that I was going to get sweaty even so. I stopped and took off my synthetic down jacket, which helped a ton.\n\nEventually, we took a short break. I chowed down a Gu and tried to eat a Clif bar, but it had gotten too hard to bite through. I put it further in my jacket to warm up. We stayed long enough to pee and that was about it. I'm not sure if it was this break or a later one, but I got worried about my feet. Luckily I had brought my thicker socks and a changed out the ones I had on with the crazy thick ones. We pressed on.\n\nI felt pretty good, and Dan seemed pretty good too. My Dad and John didn't seem too bad, but they both looked very intent on just getting up the hill. Everyone else seemed OK, except Kat. Rufano had returned to us without Kat. He had decided that it was too dangerous for her to keep going on, and sent her back down. She  had given him her Team Bandana so it would get to the top in proxy. \n\nSome time later, my Dad started having a tough time, and they relieved him of his pack. He wasn't sick or anything, but was having a very hard time catching his breath. They don't want you to stop at all. They prefer that you move a snail's pace to stop-and-go. They had also taken John's pack to help him out.\n\nWe relentlessly crawled up the trail for hours.\n\nEventually, the Moon set and it got quite a bit darker, requiring me to turn my headlamp on. It also got colder, eventually freezing my water bladder as well. We had to make do with Dan feeding my Dad and I for a while.\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/pre-dawn.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/pre-dawn-thumb.jpg\" \/><\/a>\n<figcaption>Before dawn<\/figcaption><\/figure>\n\nAnd still we walked. My Dad was not doing well and eventually I asked Bruno to check him out and make sure he was OK. He said my Dad was fine, but not to stop. This did not make my Dad happy at all. As the sky showed just the inkling of getting brighter, Bruno took both of my Dad's hands and began to lead him up the trail on his own. I followed for a while, but some time later Bruno sent me away to the rest of the group who had gone on ahead.\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/summit-tea.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/summit-tea-thumb.jpg\" \/><\/a>\n<figcaption>Hot drinks at dawn<\/figcaption><\/figure>\n\nI was still feeling fine, and soon the sun was brightening the horizon. As the sun rose, we stopped for hot drinks and watched the stunning sunrise. It was exactly what we needed at that point. We still had a while to go before we hit Stella Point. Bruno and my Dad continued on ahead without us. Very soon after, my Camelback unfroze.\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/summit-dawn.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/summit-dawn-thumb.jpg\" \/><\/a>\n<figcaption>Sun rising over Mawenzi peak<\/figcaption><\/figure>\n\nThe trail here became even more difficult. Not only did it get much steeper, but it was just a wash of scree and dust a few inches think. I sometimes felt like I was hardly making any forward progress as I inched ahead. Stella Point was visible; we could see hikers who had reached it earlier. After so long, it seemed stubbornly high above us.\n\nAs we plodded up, trekkers who had begun earlier or hiked faster than we did started to come down. As is always the case, they said things like \"You're almost there\" and \"It's just up ahead\" cheerfully and one had the sudden urge to punch them in the face. That, however, would have taken vital energy needed to get up the hill.\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/stella-point.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/stella-point-thumb.jpg\" \/><\/a>\n<figcaption>The crew at Stella Point<\/figcaption><\/figure>\n\nAn hour later (I'm guessing), we reached Stella Point. Looking down, I could see practically the whole trail as well as Barafu Camp. It hardly seemed like it should take seven or eight hours of effort from this vantage point, but then again we were at 18,848 ft. It's a 3,600-foot climb over 2.5 miles. The air pressure is half of what it is at sea level. Perhaps I could have tripped them.\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/stella-down.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/stella-down-thumb.jpg\" \/><\/a>\n<figcaption>Down from Stella Point. Barafu Camp is on the right-most ridge, near the middle of the photo. The cloud bank obscures another 12,000 ft of mountain.<\/figcaption><\/figure>\n\nMy Dad and Bruno rejoined us at Stella and we took a celebratory break. The hardest part was over. We had been given a snack\/breakfast to  bring up in our packs and had that. For the life of me, I couldn't find mine. It wasn't in my pack but I was certain that I had packed it. I ended up eating a Clif bar and some stuff others didn't want from their bags. (I'll skip to the solution of this mystery and tell you that it WAS in the bag, it had just slipped into a cranny that I didn't check.)\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/crater-glacier.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/crater-glacier-thumb.jpg\" \/><\/a>\n<figcaption>Glaciers from the last ice age. They are much larger than they look here.<\/figcaption><\/figure>\n\nFrom Stella Point, we started a 45 minute hike to Uhuru Peak, which is the highest point on the mountain. This part of the hike is still a steady climb, but compared to what we did to gain Stella Point it was pretty easy. This trail runs along the rim of the crater, with amazing views both into the crater and out along the glaciers surrounding it.\n\n<div style=\"border: solid 1px; padding: 20px; margin-bottom: 20px; background: #EEE7D8;\">\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/summit.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/summit-thumb.jpg\" \/><\/a>\n<figcaption>AT THE SUMMIT!<\/figcaption><\/figure>\n\nEventually (and it certainly felt like \"eventually\") we saw the famous sign marking Uhuru Peak. Reaching it was cathartic to the point of tears for some (and near-tears for others). It felt indescribably amazing to have reached the top. We had been hiking for six full days across terrain that was basically like another planet to get there. At 19,341 ft, we were higher than anything else in all of Africa. This is the kind of measurement one expects to hear from an airplane pilot when discussing \"cruising altitude\".\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/dad-and-i.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/dad-and-i-thumb.jpg\" \/><\/a>\n<figcaption>Dad and I<\/figcaption><\/figure>\n<\/div>\n\nWe took a bunch of photos at the sign, of course. In the meantime, Dan set to work carefully setting up his tripod for a group photo. He was very intent on this task. Scary intent.\n\nHe was intent because being this high was a little like being <i>high<\/i>. A bit like being drunk, except none of the fun parts. Just the part where you know you aren't operating properly and have to focus carefully to do anything. Dan got it set up and all of us posed and he hit the 10-second timer. He had maybe ten or fifteen feet to go... and he didn't quite make it in time. If you know Dan, you know how this proves how disabled the rest of us likely were. The second try worked like a charm.\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/crater.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/crater-thumb.jpg\" \/><\/a>\n<figcaption>The crater towards Stella Point from Uhuru Peak. The trail we took goes along the ridge on the right. The trail into the crater goes up to Stella Point.<\/figcaption><\/figure>\n\nYou aren't supposed to stay long at the top, and we were soon retreating to Stella Point. We were allowed to go our own pace at this point, which was good because I wanted TAKE SOME FULL STEPS instead of pole-pole shuffling.\n\nWe pretty quickly got back to Stella Point, took a short break, and then began our descent. I had felt pretty good all the way up, but things would be different by the time I got back to Barafu Camp.\n\n<figure>\n<a href=\"https:\/\/picasaweb.google.com\/posniewski\/Summit?authuser=0&feat=directlink\">\n<img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/summit-collage.jpg\" \/><\/a>\n<figcaption>Click here to see more photos from this part of the trip.<\/figcaption>\n<\/figure>\n\n",
    "id":"20111015_9_053632",
    "link":"",
    "publishedDate":"2011-10-15T05:36:32+00:00",
    "source":"foamtotem",
    "title":"Killimanjaro: Summit",
    "via":"",
    "~orig":
        {
        },
    "~orig.728337349_274422395925470":
        {
            "actions":
                [
                    
                    {
                        "link":"http:\/\/www.facebook.com\/728337349\/posts\/274422395925470",
                        "name":"Comment"
                    },
                    
                    {
                        "link":"http:\/\/www.facebook.com\/728337349\/posts\/274422395925470",
                        "name":"Like"
                    }
                ],
            "application":
                {
                },
            "caption":"foamtotem.org",
            "comments":
                {
                    "data":
                        [
                            
                            {
                                "can_remove":"1",
                                "created_time":"2011-10-15T17:01:24+0000",
                                "from":
                                    {
                                        "id":"1134692210",
                                        "name":"Shelley Day Posniewski"
                                    },
                                "id":"728337349_274422395925470_3898671",
                                "message":"I don't want these entries to end."
                            },
                            
                            {
                                "can_remove":"1",
                                "created_time":"2011-10-15T17:14:22+0000",
                                "from":
                                    {
                                        "id":"653106427",
                                        "name":"Sarah Burns Feyl"
                                    },
                                "id":"728337349_274422395925470_3898716",
                                "likes":1,
                                "message":"I got a little teary eyed reading this. How wonderful for you and your Dad to do this together. :-)",
                                "user_likes":"1"
                            },
                            
                            {
                                "can_remove":"1",
                                "created_time":"2011-10-15T20:42:36+0000",
                                "from":
                                    {
                                        "id":"100000070828265",
                                        "name":"Mark Farrell"
                                    },
                                "id":"728337349_274422395925470_3899565",
                                "likes":1,
                                "message":"Great picture of you and your dad!",
                                "user_likes":"1"
                            },
                            
                            {
                                "can_remove":"1",
                                "created_time":"2011-10-16T02:09:34+0000",
                                "from":
                                    {
                                        "id":"1554010659",
                                        "name":"Donna Peronace"
                                    },
                                "id":"728337349_274422395925470_3900643",
                                "likes":1,
                                "message":"What an amazing experience to have and to share with your Dad!  Your posts really give a sense of what it was like.  Thank you for sharing.",
                                "user_likes":"1"
                            },
                            
                            {
                                "can_remove":"1",
                                "created_time":"2011-10-16T03:50:51+0000",
                                "from":
                                    {
                                        "id":"100000449847369",
                                        "name":"Carol Kuhn"
                                    },
                                "id":"728337349_274422395925470_3900933",
                                "likes":1,
                                "message":"Shannon & Jim: Amazing! That summarizes all I can say. I will never complain about a blister ever, ever again. Or about being out of breath coming up  our pasture hill,  Thanks for your honest journals.",
                                "user_likes":"1"
                            }
                        ],
                    "paging":
                        {
                            "next":"https:\/\/graph.facebook.com\/728337349_274422395925470\/comments?access_token=202981499713630|f0e29551db76a6dbed4c8d5e.1-728337349|1C7yRomzW6wd2-7ogKO4lZLcdEI&limit=25&offset=25"
                        }
                },
            "created_time":"2011-10-15T16:32:21+0000",
            "description":"I know we had dinner at Barafu, but I have no recollection of it. (As I mentioned, my journal has run dry.) We went to our tents until 10:30pm, when we were to start getting ready and have a snack.",
            "from":
                {
                    "id":"728337349",
                    "name":"Shannon Posniewski"
                },
            "icon":"https:\/\/s-static.ak.facebook.com\/rsrc.php\/v1\/yR\/r\/23eNFy_VOig.gif",
            "id":"728337349_274422395925470",
            "likes":
                {
                    "count":7,
                    "data":
                        [
                            
                            {
                                "id":"728337349",
                                "name":"Shannon Posniewski"
                            },
                            
                            {
                                "id":"100000722183506",
                                "name":"Lon Chapman"
                            },
                            
                            {
                                "id":"1554010659",
                                "name":"Donna Peronace"
                            },
                            
                            {
                                "id":"1361476318",
                                "name":"Michele Liguori"
                            },
                            
                            {
                                "id":"1668381293",
                                "name":"Kevin Morris"
                            }
                        ]
                },
            "link":"http:\/\/www.foamtotem.org\/2011\/20111015_9_053632.html",
            "message":"I finally get to the good part: the midnight hike to the summit of Kilimanjaro!",
            "name":"Killimanjaro: Summit",
            "picture":"https:\/\/s-external.ak.fbcdn.net\/safe_image.php?d=AQCaa-xc3TcuGQ7c&w=90&h=90&url=http%3A%2F%2Ffoamtotem.org%2Fdaily%2Fimages%2Fkili%2Fsummit-thumb.jpg",
            "privacy":
                {
                    "allow":"0",
                    "deny":"0",
                    "description":"Friends of Friends",
                    "value":"FRIENDS_OF_FRIENDS"
                },
            "type":"link",
            "updated_time":"2011-10-16T03:50:51+0000"
        }
}