{
    "comments":
        {
            "data":
                [
                    
                    {
                        "can_remove":"1",
                        "created_time":"2011-10-01T17:15:25+0000",
                        "from":
                            {
                                "id":"728337349",
                                "name":"Shannon Posniewski"
                            },
                        "id":"728337349_255504857820189_3450791",
                        "likes":3,
                        "message":"I'm trying to mix useful facts for those who might go to Tanzania in with what we actually did, so the writing comes off a bit scattered. If I was inclined to spend a lot longer, it'd certainly be brilliant."
                    },
                    
                    {
                        "can_remove":"1",
                        "created_time":"2011-10-03T02:30:58+0000",
                        "from":
                            {
                                "id":"100000449847369",
                                "name":"Carol Kuhn"
                            },
                        "id":"728337349_255504857820189_3457252",
                        "likes":2,
                        "message":"Save brilliant for the movie version. We will take the Pollock version of useful facts & dids. More entertaining, instant gratification. Colorful. Thanks!"
                    }
                ]
        },
    "content":"\nAs we had flown in after dark, the next morning was when we really saw Moshi for the first time. Moshi is one of the larger cities in Tanzania (10th largest or so).\n\n<figure><a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/moshi-street.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/moshi-street-thumb.jpg\" \/><\/a>\n<figcaption>Typical street in Moshi. This is just off the main drag.<\/figcaption>\n<\/figure>\n\nBreakfast was included at the hotel, and afterwards we went sightseeing and shopping around Moshi. A group of eight very-not-native people wandering around town drew the notice of a number of \"helpful\" young men. They made conversation and were very nice, and wanted very much for us to buy things from them or visit their shop down the way. Getting rid of these people was basically impossible, and I grew rather uncomfortable with them around.\n\nIncidentally, there really aren't any sights to see in Moshi.\n\nWe had intended to travel to a larger city, Arusha (via bus, an hour away). This whole idea was doomed from the start. We went to the bus center where there were a couple score of buses. (All buses are private rather than public.) We tried to figure out which bus to take and how much it would cost and were unable to do so. Our helpful new friends were of no help at all. We decided, finally, to not bother going to Arusha (it was getting a bit late anyway).\n\nFor those trying this on their own, good luck and godspeed. Heather went to Arusha via bus while we hiked Kili. Even with pretty clear instructions from someone, she got a bit of a runaround before finally getting to a bus. I suggest having a local you trust help you (say your guide) or just have the tour company arrange it. It may not be \"authentic\", but you may actually arrive where you're trying to go.\n\n<figure><a href=\"https:\/\/plus.google.com\/photos\/103104079397182944597\/albums\/5655063820575472801?hl=en\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/moshi-gallery-thumb.jpg\" \/><\/a>\n<figcaption>Click to see the Moshi gallery<\/figcaption>\n<\/figure>\n\nWe ate lunch at the Chagga Grill. Chosen from the guidebook because it was real local food. Turns out most of us didn't really like it, and they overcharged us (even so, it wasn't too expensive). (I'm guessing we didn't get the good food looking as non-local as we did.) I was largely variations on boiled potatoes, carrots, okra, and chicken\/beef\/mutton. A staple starch is ugali (made from corn) which is basically the equivalent to Hawaii's poi. Consistency of mashed potatoes, but more bland.\n\nA bit more wandering around town and I was ready for a break. Some went looking for a coffee house, I went to the hotel. Around 6pm I went out on the roof and saw Mount Kilimanjaro for the first time.\n\n<figure><a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/moshi-street.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/kili-from-panama.jpg\" \/><\/a>\n<figcaption>Kilimanjaro<\/figcaption>\n<\/figure>\n\nWe gathered for dinner and went to a place we had seen that morning called \"Deli Chez\". We are uncertain if this is a play on \"delicious\" or a misguided attempt at being cosmopolitan. The menus were about ten pounds and had lots of Indian, Chinese, and Korean food as well as burgers and pizza. We liked the place (and would recommend it). The food was good and the prices reasonable. We spent around 67K TSh for the nine of us.\n\nThe trip back to the hotel was dark. Streetlights are not a fixture in town, which I guess shouldn't have been a surprise. However, one takes some things for granted without even thinking about it.\n\nListening to the bar across the street as I went to sleep, I realized that <a href=\"http:\/\/vimeo.com\/7545734\">Auto-Tune<\/a> had found and invaded Africa.\n",
    "id":"20111001_9_020513",
    "link":"",
    "publishedDate":"2011-10-01T02:05:13+00:00",
    "source":"foamtotem",
    "title":"Kilimanjaro: Moshi Town",
    "via":"",
    "~orig":
        {
        },
    "~orig.728337349_255504857820189":
        {
            "actions":
                [
                    
                    {
                        "link":"http:\/\/www.facebook.com\/728337349\/posts\/255504857820189",
                        "name":"Comment"
                    },
                    
                    {
                        "link":"http:\/\/www.facebook.com\/728337349\/posts\/255504857820189",
                        "name":"Like"
                    }
                ],
            "application":
                {
                },
            "caption":"foamtotem.org",
            "comments":
                {
                    "data":
                        [
                            
                            {
                                "can_remove":"1",
                                "created_time":"2011-10-01T17:15:25+0000",
                                "from":
                                    {
                                        "id":"728337349",
                                        "name":"Shannon Posniewski"
                                    },
                                "id":"728337349_255504857820189_3450791",
                                "likes":3,
                                "message":"I'm trying to mix useful facts for those who might go to Tanzania in with what we actually did, so the writing comes off a bit scattered. If I was inclined to spend a lot longer, it'd certainly be brilliant."
                            },
                            
                            {
                                "can_remove":"1",
                                "created_time":"2011-10-03T02:30:58+0000",
                                "from":
                                    {
                                        "id":"100000449847369",
                                        "name":"Carol Kuhn"
                                    },
                                "id":"728337349_255504857820189_3457252",
                                "likes":2,
                                "message":"Save brilliant for the movie version. We will take the Pollock version of useful facts & dids. More entertaining, instant gratification. Colorful. Thanks!"
                            }
                        ]
                },
            "created_time":"2011-10-01T17:09:40+0000",
            "description":"As we had flown in after dark, the next morning was when we really saw Moshi for the first time.",
            "from":
                {
                    "id":"728337349",
                    "name":"Shannon Posniewski"
                },
            "icon":"https:\/\/s-static.ak.facebook.com\/rsrc.php\/v1\/yD\/r\/aS8ecmYRys0.gif",
            "id":"728337349_255504857820189",
            "likes":
                {
                    "count":2,
                    "data":
                        [
                            
                            {
                                "id":"1134692210",
                                "name":"Shelley Day Posniewski"
                            },
                            
                            {
                                "id":"100000746582347",
                                "name":"Russell Smith"
                            }
                        ]
                },
            "link":"http:\/\/www.foamtotem.org\/2011\/20111001_9_020513.html",
            "message":"We finally get to see Africa in the daylight, Kilimanjaro is spied for the first time, and auto-tune rules the night.",
            "name":"Kilimanjaro: Moshi Town",
            "picture":"https:\/\/s-external.ak.fbcdn.net\/safe_image.php?d=AQCeneTkdGJg6JG3&w=90&h=90&url=http%3A%2F%2Ffoamtotem.org%2Fdaily%2Fimages%2Fkili%2Fkili-from-panama.jpg",
            "privacy":
                {
                    "allow":"0",
                    "deny":"0",
                    "description":"Friends of Friends",
                    "value":"FRIENDS_OF_FRIENDS"
                },
            "type":"link",
            "updated_time":"2011-10-03T02:30:58+0000"
        }
}