{
    "comments":
        {
            "data":
                [
                    
                    {
                        "can_remove":"1",
                        "created_time":"2011-10-10T21:49:48+0000",
                        "from":
                            {
                                "id":"1668381293",
                                "name":"Kevin Morris"
                            },
                        "id":"728337349_272084136157193_3840849",
                        "message":"Another great chapter.  Looking forward to the next.  Your narrative has me in anticipation wondering about your dad and kat."
                    },
                    
                    {
                        "can_remove":"1",
                        "created_time":"2011-10-10T22:02:17+0000",
                        "from":
                            {
                                "id":"1431258542",
                                "name":"Ginny Norris-Napier"
                            },
                        "id":"728337349_272084136157193_3840885",
                        "message":"Just a fabulous journal of your trek. It truly was the most amazing experience oft life. Your story brings back great memories!  Thank you for documenting all of this!"
                    },
                    
                    {
                        "can_remove":"1",
                        "created_time":"2011-10-11T03:27:03+0000",
                        "from":
                            {
                                "id":"1554010659",
                                "name":"Donna Peronace"
                            },
                        "id":"728337349_272084136157193_3842340",
                        "message":"Thanks Poz, looking forward to the next one!"
                    }
                ]
        },
    "content":"\nThe night at Shira was cold enough to freeze the evening mist on the ground and tents. I had to get up twice in the night to pee and visit the tentapotty. This was my fifth night in Africa and the diet change had a predicatble effect on my stomach. I took Immodium in the morning as I didn't want any sudden emgergencies on the trail.\n\nThe second time I got up it was around 4:30am and the stars were amazing. When the nearly-full moon is visible, the dimmer stars are harder to see. But at this hour, the moon had set and the sun wasn't lighting the sky, so the stars were out in their full glory.\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/shira-morning.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/shira-morning-thumb.jpg\" \/><\/a>\n<figcaption>Morning at Shira Camp.<\/figcaption>\n<\/figure>\n\nEven with the cold outside, I was plenty warm in my sleeping bag. (Others were not as comfortable.) Once the sun hit the camp, it was plenty warm out. We did a better job of getting up on time and were on the trail by around 8:15am.\n\nThis was a long, long day. We backtracked a bit to get to the ridge again and then followed a long, continuous rise along it. Again, vegetation was rare and hardy stuff. The ground was dusty and covered with stones and boulders of every size. It's difficult to tell how big they are in the photos because of this.\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/shira-plateau.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/shira-plateau-thumb.jpg\" \/><\/a>\n<figcaption>Mount Meru in the distance, the ever-present cloud bank, and Shira Plateau<\/figcaption>\n<\/figure>\n\nWe took a short break where we could see the pretty huge expanse of Shira Plateau, the cathedral, Mount Meru (way off in the distance), and down the way we came. If the clouds had burned off, we would have been able to see all the way down to the road we drove in on.\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/dan-shira-plateau.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/dan-shira-plateau-thumb.jpg\" \/><\/a>\n<figcaption>Dan, Meru, back towards Shira Camp.<\/figcaption>\n<\/figure>\n\nI felt pretty good the whole way up. Most everyone was feeling it in their legs (not a surprise, we had been basically working a Starimaster for the last two days) but I guess all that running I do helped there. My Dad had led the first two hours of the hike, and then petered out. Later on, he said that he felt like he had stood up too quickly. That feeling didn't leave until we got to lunch. If I went too fast, I'd start to get a headache, but if I slowed down or was careful with my breathing it would go away. Pole pole.\n\nAlong the way, the trail met up with the Lemosho route and continued in a much more level fashion on to the lunch stop. At one point there was a rocky outcropping and I had assumed it was the Lava Tower; I was pretty unimpressed. However, it wasn't the Lava Tower which actually is pretty impressive.\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/barranco-lunch.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/barranco-lunch-thumb.jpg\" \/><\/a>\n<figcaption>Lunch spot. You can see the trail continue across the center.<\/figcaption>\n<\/figure>\n\nBefore we got to the Lava Tower, and not a moment too soon, was lunch. Again, they had set up our tent and we had a hot lunch. Grilled cheese sandwiches and curry. Sounds awesome typing it right now, but I wasn't hungry for it. I forced some down. A while before the stop I had eaten a Clif bar and just after I had a Gu shot.\n\nI knew that I wasn't eating as much as I probably should have been, but I was cramming down what I could. Some people get sick enough that they can't keep food down; luckily I was not that bad. I just didn't want to eat anything. On this day, however, my Dad was not as lucky. I found out later that night that he had gotten sick at lunch.\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/lava-tower.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/lava-tower-thumb.jpg\" \/><\/a>\n<figcaption><\/figcaption>\n<\/figure>\n\nAfter lunch we hiked to the Lava Tower, which would be the highest point we hit that day at 15,000 ft (a 2,600 ft climb from Shira). To acclimate, remember, the idea is to hike high and sleep low. We did that to some extent the day before when we went to the Window. Today would be a much bigger difference: Barranco (our destination) is only 500 ft above Shira. We were about to drop 2,000 ft or so.\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/two-towers.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/two-towers-thumb.jpg\" \/><\/a>\n<figcaption>The Two (smaller) Towers<\/figcaption>\n<\/figure>\n\nThe Lava Tower was pretty cool as we approached it, but was much cooler as we descended. You go through two big towers and then drop very rapidly. When you look back, though, you get a better feeling for how massive it is. From above, it doesn't seem as large.\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/below-lava-tower.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/below-lava-tower-thumb.jpg\" \/><\/a>\n<figcaption>Lava Tower (the previous picture was of the two little towers off to the right)<\/figcaption>\n<\/figure>\n\nThe trail went down, down, down into the mist and seemed to take much, much longer than it should have. The distance from the Lava Tower to Barranco is only 2.5 miles, but at these altitudes and pitches it's not easy. (Evidence of our being tired: I have no photos of this descent after the Tower. Of particular interest would have been the <a href=\"http:\/\/www.asknature.org\/strategy\/0735390f590e843ad982f11c046e85d0\">giant groundsels<\/a>.) My Dad continued not feeling well: he got sick again part of the way down the hill. He wasn't continuously nauseous, it would just come on and hit.\n\nMy Dad wasn't the only one having problems. About 3\/4 of the way down Kat and Craig (who were hiking next to each other) heard a giant \"pop\", which was Kat's kneecap coming undone or some other horrid thing. She made it to Barranco Camp fine, but was in considerable pain. There is no easy exit from Barranco, however. She'd have to walk with us to Karanga tomorrow, where there is a descent to Millenium Camp. Even with the pain, she held up well.\n\n<figure>\n<a href=\"http:\/\/foamtotem.org\/daily\/images\/kili\/barranco-valley.jpg\"><img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/barranco-valley-thumb.jpg\" \/><\/a>\n<figcaption>Barranco Valley below the camp.<\/figcaption>\n<\/figure>\n\nAfter dropping our packs, getting our tents together, and washing up, we had dinner at 6:30pm. Rice and beef stew\/curry. I was able to eat some of it, but Dad couldn't keep any down. He and I started him on drinking water with electrolytes. He went to sleep right away. My lingering headaches led me to take a full dose of Diamox (250mg). I had decided to take pseudoephedrine at night so my nose\/sinuses don't get stuffed up and keep me awake. I figured that normal sleeping was hard enough.\n\nNone of us were feeling great, but the guides weren't worried (except for Kat's injury). They said that this day is very tough and we would all feel a lot better the next day. I hoped so.\n\n<figure>\n<a href=\"https:\/\/picasaweb.google.com\/posniewski\/Barranco?authuser=0&feat=directlink\">\n<img src=\"http:\/\/foamtotem.org\/daily\/images\/kili\/barranco.jpg\" \/><\/a>\n<figcaption>Click here to see more photos from this part of the trip.<\/figcaption>\n<\/figure>\n",
    "id":"20111010_9_204401",
    "link":"",
    "publishedDate":"2011-10-10T20:44:01+00:00",
    "source":"foamtotem",
    "title":"Kilimanjaro: Barranco Camp",
    "via":"",
    "~orig":
        {
        },
    "~orig.728337349_272084136157193":
        {
            "actions":
                [
                    
                    {
                        "link":"http:\/\/www.facebook.com\/728337349\/posts\/272084136157193",
                        "name":"Comment"
                    },
                    
                    {
                        "link":"http:\/\/www.facebook.com\/728337349\/posts\/272084136157193",
                        "name":"Like"
                    }
                ],
            "application":
                {
                },
            "caption":"foamtotem.org",
            "comments":
                {
                    "data":
                        [
                            
                            {
                                "can_remove":"1",
                                "created_time":"2011-10-10T21:49:48+0000",
                                "from":
                                    {
                                        "id":"1668381293",
                                        "name":"Kevin Morris"
                                    },
                                "id":"728337349_272084136157193_3840849",
                                "message":"Another great chapter.  Looking forward to the next.  Your narrative has me in anticipation wondering about your dad and kat."
                            },
                            
                            {
                                "can_remove":"1",
                                "created_time":"2011-10-10T22:02:17+0000",
                                "from":
                                    {
                                        "id":"1431258542",
                                        "name":"Ginny Norris-Napier"
                                    },
                                "id":"728337349_272084136157193_3840885",
                                "message":"Just a fabulous journal of your trek. It truly was the most amazing experience oft life. Your story brings back great memories!  Thank you for documenting all of this!"
                            },
                            
                            {
                                "can_remove":"1",
                                "created_time":"2011-10-11T03:27:03+0000",
                                "from":
                                    {
                                        "id":"1554010659",
                                        "name":"Donna Peronace"
                                    },
                                "id":"728337349_272084136157193_3842340",
                                "message":"Thanks Poz, looking forward to the next one!"
                            }
                        ]
                },
            "created_time":"2011-10-10T21:21:51+0000",
            "description":"The night at Shira was cold enough to freeze the evening mist on the ground and tents. I had to get up twice in the night to pee and visit the tentapotty.",
            "from":
                {
                    "id":"728337349",
                    "name":"Shannon Posniewski"
                },
            "icon":"https:\/\/s-static.ak.facebook.com\/rsrc.php\/v1\/yR\/r\/23eNFy_VOig.gif",
            "id":"728337349_272084136157193",
            "likes":
                {
                    "count":4,
                    "data":
                        [
                            
                            {
                                "id":"728337349",
                                "name":"Shannon Posniewski"
                            },
                            
                            {
                                "id":"1554010659",
                                "name":"Donna Peronace"
                            },
                            
                            {
                                "id":"1134692210",
                                "name":"Shelley Day Posniewski"
                            },
                            
                            {
                                "id":"770382751",
                                "name":"Jennifer Jumper"
                            }
                        ]
                },
            "link":"http:\/\/www.foamtotem.org\/2011\/20111010_9_204401.html",
            "message":"Kneecaps, grilled cheese sandwiches, Tower of Lava, and altitude sickness are all featured in this episode.",
            "name":"Kilimanjaro: Barranco Camp",
            "picture":"https:\/\/s-external.ak.fbcdn.net\/safe_image.php?d=AQAAnK3TYc5_LiJF&w=90&h=90&url=http%3A%2F%2Ffoamtotem.org%2Fdaily%2Fimages%2Fkili%2Fbarranco-lunch-thumb.jpg",
            "privacy":
                {
                    "allow":"0",
                    "deny":"0",
                    "description":"Friends of Friends",
                    "value":"FRIENDS_OF_FRIENDS"
                },
            "type":"link",
            "updated_time":"2011-10-11T03:27:03+0000"
        }
}