{
    "comments":
        {
            "data":
                [
                    
                    {
                        "can_remove":"1",
                        "created_time":"2012-10-12T22:54:09+0000",
                        "from":
                            {
                                "id":"1504001963",
                                "name":"Dan Prendergast"
                            },
                        "id":"728337349_188988211237182_594684",
                        "like_count":0,
                        "message":"My read is, you still prefer the Apple product, right?",
                        "user_likes":"0"
                    },
                    
                    {
                        "can_remove":"1",
                        "created_time":"2012-10-12T23:03:27+0000",
                        "from":
                            {
                                "id":"1612092462",
                                "name":"Alex Sorensen"
                            },
                        "id":"728337349_188988211237182_594740",
                        "like_count":0,
                        "message":"tl;dr? Cuz I just bought the Galaxy Tab 2 as opposed to the Nexus 7",
                        "user_likes":"0"
                    },
                    
                    {
                        "can_remove":"1",
                        "created_time":"2012-10-12T23:24:21+0000",
                        "from":
                            {
                                "id":"1245484058",
                                "name":"Sarah Rain"
                            },
                        "id":"728337349_188988211237182_594832",
                        "like_count":0,
                        "message":"Might think about whether your old iPad could be made usable as a Christmas present for Alyra.",
                        "user_likes":"0"
                    },
                    
                    {
                        "can_remove":"1",
                        "created_time":"2012-10-13T00:13:33+0000",
                        "from":
                            {
                                "id":"728337349",
                                "name":"Shannon Posniewski"
                            },
                        "id":"728337349_188988211237182_594959",
                        "like_count":0,
                        "message":"The tl;dr is in the title: \"I love the Nexus 7\". I would love it MORE if it had a 10\" screen. The Apple ecosystem is now leaving a bad enough taste in my mouth and Android is now improved enough that I think that they are neck in neck, with Apple getting the nod. The rumored iPad mini is not interesting to me (because I learned that 7\" is not enough [insert rude joke here]) and after the blah iPhone 5, I don't expect anything earthshaking for the next iPad due next spring.",
                        "user_likes":"0"
                    },
                    
                    {
                        "can_remove":"1",
                        "created_time":"2012-10-13T00:35:17+0000",
                        "from":
                            {
                                "id":"1249748103",
                                "name":"Joel Stepanek"
                            },
                        "id":"728337349_188988211237182_594997",
                        "like_count":0,
                        "message":"I like mine.",
                        "user_likes":"0"
                    }
                ]
        },
    "content":"\nA long-time iOS user, I decided that it was time to try out an Android device.\n\nApple recently released their new OS update on everything but the original iPad. I have loved my iPad, but with every update it has become more and more irritating to use because apps crash all the time. I believe the cause is that there is too little memory in it. The OS has a watchdog that kills programs that use too much memory, or too much memory too rapidly. It kills off Safari (the built-in web browser) a lot. While I'm in the middle of reading something. As they've upgraded the OS, it has been happening more and more. And now they've decided that it's the end of the line for iPad 1.\n\nIt's a huge bummer because it's still great device. I'd still be using it constantly if it didn't crash all the time. It's a great example of why it should be made straightforward for consumers to load an alternative OS on their devices. This great piece of hardware is effectively dead because its built-in software is too bloated to run on it.\n\nI didn't expect to rant, but there you go.\n\nThe new hotness is the Google Nexus 7, a 7\" (diag) tablet running the latest Android (Jellybean). It's basically the same as a Kindle Fire without any special Amazon stuff on it. Though made by Asus, it's administered by Google so there are no extra OS skins, special apps, or other stink that manufacturers feel the need to cram on their computers.\n\nIn short, I think it's great. It's the first non-Apple touch device I've used that feels as tight and responsive as the iPad\/iPhone. The UI is different from the iOS UI, and in many ways I think it's better.\n\nI love, for example, the cross-app back button. It works like the back button in a browser, except that it'll go to previously used applications. An example would be that you're in Twitter and click a link. It opens the link in Chrome. When you're done reading, you press the back button and it pops back to Twitter right where you left off. It's pretty slick...\n\nExcept when it doesn't work as expected. It's clearly up to the app writer to make sure it works consistently, and it's clear that not all app developers agree on what consistent means. This is a general problem with Android. They aren't as clear or as stringent with UI conventions as iOS. So there's quite a bit of variability in behavior.\n\nThe high DPI screen, of course, is awesome. Please, please, please come to my desktop monitor Mr. Resolution.\n\nI use a lot of Google services already so all the built-in apps work great for me. On the whole, they aren't as polished as Apple's. But they update their apps fairly often, so that might not be true for very long. (Oh, and they automatically update apps (though this can be shut off) which is double-plus awesome. Why oh why doesn't iOS do so?)\n\nOn to some bad stuff. It has a single, rather crappy, front-facing camera. I guess the idea is to use it for video conferencing. It really needs a rear camera.\n\nWeak and shifting Android style standards means that different programs don't look consistent or act the same way. For example, where does the options button go? Are buttons flat-shaded or drawn with a gradient? Should hitting the top left of the app go \"home\" or go \"back\"?\n\nEvery possible color, baseline, size, and style is used for the icons on the desktop. And this is just the Google icons! They really need to lead the way with a bunch of classy icons. iOS approaches this problem by boxing all icons, which makes the whole look feel unified even if the icons are all over the place.\n\nI really, really miss being able to touch the top edge of the screen to scroll to the top of a document, such as a web page. I am shocked to find how much I use it on iOS. I haven't found an equivalent on Android yet, so I fear that there is none.\n\nI have yet to find a good general use for widgets. Audio controls, perhaps. I can imagine a daily agenda being useful (if I had a daily agenda). Other than that, the widgets all seem universally pointless.\n\nFinally, I have found that I miss the larger 10 inch screen of the iPad. That's a personal preference, not a knock on the device. I'd say 90% of the time I spend with the device is web-oriented and the real estate makes it more readable and navigable.\n\nAll in all, though, I love it. I am seriously considering an Android phone for my next phone. I would miss only two things from the iPhone: Runmeter and Reeder, neither of which have Android versions. I'd live without Reeder, but I've grown quite used to Runmeter. There are other GPS running apps out there, though, and Runmeter does let you export your data. Runmeter just *works right*, though.",
    "description":"A long-time iOS user, I decided that it was time to try out an Android device.",
    "id":"20121012_9_214857",
    "link":"",
    "publishedDate":"2012-10-12T21:48:57+00:00",
    "source":"foamtotem",
    "title":"I Love the Nexus 7",
    "via":"",
    "~orig":
        {
        },
    "~orig.728337349_188988211237182":
        {
            "actions":
                [
                    
                    {
                        "link":"http:\/\/www.facebook.com\/728337349\/posts\/188988211237182",
                        "name":"Comment"
                    },
                    
                    {
                        "link":"http:\/\/www.facebook.com\/728337349\/posts\/188988211237182",
                        "name":"Like"
                    }
                ],
            "application":
                {
                },
            "caption":"foamtotem.org",
            "comments":
                {
                    "data":
                        [
                            
                            {
                                "can_remove":"1",
                                "created_time":"2012-10-12T22:54:09+0000",
                                "from":
                                    {
                                        "id":"1504001963",
                                        "name":"Dan Prendergast"
                                    },
                                "id":"728337349_188988211237182_594684",
                                "like_count":0,
                                "message":"My read is, you still prefer the Apple product, right?",
                                "user_likes":"0"
                            },
                            
                            {
                                "can_remove":"1",
                                "created_time":"2012-10-12T23:03:27+0000",
                                "from":
                                    {
                                        "id":"1612092462",
                                        "name":"Alex Sorensen"
                                    },
                                "id":"728337349_188988211237182_594740",
                                "like_count":0,
                                "message":"tl;dr? Cuz I just bought the Galaxy Tab 2 as opposed to the Nexus 7",
                                "user_likes":"0"
                            },
                            
                            {
                                "can_remove":"1",
                                "created_time":"2012-10-12T23:24:21+0000",
                                "from":
                                    {
                                        "id":"1245484058",
                                        "name":"Sarah Rain"
                                    },
                                "id":"728337349_188988211237182_594832",
                                "like_count":0,
                                "message":"Might think about whether your old iPad could be made usable as a Christmas present for Alyra.",
                                "user_likes":"0"
                            },
                            
                            {
                                "can_remove":"1",
                                "created_time":"2012-10-13T00:13:33+0000",
                                "from":
                                    {
                                        "id":"728337349",
                                        "name":"Shannon Posniewski"
                                    },
                                "id":"728337349_188988211237182_594959",
                                "like_count":0,
                                "message":"The tl;dr is in the title: \"I love the Nexus 7\". I would love it MORE if it had a 10\" screen. The Apple ecosystem is now leaving a bad enough taste in my mouth and Android is now improved enough that I think that they are neck in neck, with Apple getting the nod. The rumored iPad mini is not interesting to me (because I learned that 7\" is not enough [insert rude joke here]) and after the blah iPhone 5, I don't expect anything earthshaking for the next iPad due next spring.",
                                "user_likes":"0"
                            },
                            
                            {
                                "can_remove":"1",
                                "created_time":"2012-10-13T00:35:17+0000",
                                "from":
                                    {
                                        "id":"1249748103",
                                        "name":"Joel Stepanek"
                                    },
                                "id":"728337349_188988211237182_594997",
                                "like_count":0,
                                "message":"I like mine.",
                                "user_likes":"0"
                            }
                        ],
                    "paging":
                        {
                            "next":"https:\/\/graph.facebook.com\/728337349_188988211237182\/comments?access_token=AAAC4nFAvuF4BAIZB6tLeeSCKKI4DFGHScCpSYTf8vJtZAwJPZBxiD1XIyB4QWUqqpl0TOhpUJpbFfYxiB1ZBchuxszpSL00ZD&limit=25&offset=25&__after_id=728337349_188988211237182_594997"
                        }
                },
            "created_time":"2012-10-12T22:46:02+0000",
            "description":"A long-time iOS user, I decided that it was time to try out an Android device.",
            "from":
                {
                    "id":"728337349",
                    "name":"Shannon Posniewski"
                },
            "icon":"https:\/\/s-static.ak.facebook.com\/rsrc.php\/v2\/yD\/r\/aS8ecmYRys0.gif",
            "id":"728337349_188988211237182",
            "likes":
                {
                    "count":1,
                    "data":
                        [
                            
                            {
                                "id":"891985505",
                                "name":"Chris Ogden"
                            }
                        ]
                },
            "link":"http:\/\/foamtotem.org\/2012\/20121012_9_214857.html",
            "message":"Thoughts on my recently-purchased Nexus 7.",
            "name":"I Love the Nexus 7",
            "privacy":
                {
                    "allow":"10150348324912350",
                    "deny":"",
                    "description":"Everyone",
                    "friends":"SOME_FRIENDS",
                    "networks":"",
                    "value":"CUSTOM"
                },
            "status_type":"shared_story",
            "type":"link",
            "updated_time":"2012-10-13T00:35:17+0000"
        }
}