{
    "content":"\nSince my last post, I have made several modifications to the recipe to try to improve it. Most have met with failure, some catastrophic. I actually took pictures of this errors, but I am too lazy to post them. I figured, though, that I should post an update.\n\nI tried modifying and changing various ingredients. The most interesting might be the coconut flour, which I used to replace a small amount of the regular flour. This was a disaster. Everything I read about coconut flour (including the tin) was that it absorbed more moisture than regular flour. I thought this was great, because I had been experimenting with using a bit of corn syrup in the dough and it was a bit too sticky. Long story short, that whole branch on the experimental tree was a dead end. The cookies just didn't set properly and I just tossed the batch(es) away.\n\nThe closest I had gotten was <a href=\"http:\/\/foamtotem.org\/2011\/20111218_9_215409.html\">the recipe I posted last<\/a>. So, I backtracked and started some variations there. Again, some dead ends. The best cookies I've made thus far are basically the same as the original molasses recipe (with the addition of raisins and coconut).\n\n<blockquote>\nAlmost Fruit Cookies \n\n<ul>\n<li>1\/8c unsweetened coconut, rehydrated<\/li>\n<li>3\/4c shortening<\/li>\n<li>1c sugar<\/li>\n<li>1 egg<\/li>\n<li>1\/4c Brer Rabbit Molasses (dark)<\/li>\n<li>2c all-purpose flour<\/li>\n<li>2t baking soda<\/li>\n<li>1\/2t salt<\/li>\n<li>1c raisins<\/li>\n<\/ul>\n\nTake coconut and rehydrate with some hot water during the following. Cream sugar and shortening. Add egg and mix until smooth. Add molasses, mix until smooth. Mix flour, soda, and salt in a small bowl. Add to wet ingredients in a couple stages, incorporating well (but don't overdo it). Integrate raisins and drained coconut. Chill dough in fridge for a bit. Form into one inch balls, place on a cookie sheet, and flatten balls so they are about two inches wide. Make the center thinner than the edge by pushing your thumb into it.\n\nBake 8 minutes at 325F.  Pull out when tops have broken bubbles nearly to center.  Cool two minutes on cookie sheet, then move to rack to finish cooling.\n<\/blockquote>\n\nSome interesting things here. Number one is the coconut. My Dad doesn't remember coconut, and I didn't either in terms of taste. I did remember (and so did my Aunt) sometimes getting chewy bits, just like getting a piece of coconut. The last time I tried coconut, I used what I could find in the store, which was sweetened. Everyone thought the cookies made with it were too sweet.\n\nSo, I ordered some Red Mill shredded unsweetened coconut to try. Since it's dried (and I didn't want the cookies any drier), I decided to rehydrate the coconut before adding. I have yet to finish testing this batch, but I suspect 1\/8c is too little to be noticeable. We'll see.\n\nMaking big 3\" to 4\" versions of these cookies (like the originals) is difficult. The centers never cook very well. The small version (which is what the recipe is for) cooks better.\n\nLastly, these cookies are a bit too thin, and lack the big cracks that the original cookies had. They do have some cracks, but not in the same way. Basically, I need the outside to become a bit more structural\/more dried than the inside. This should automatically happen in the oven, but I think perhaps the difference in this dough between cooked\/browned and cooked\/not-browned is too small.\n\nThe next batch, I may try more egg. This should allow the cookies to keep their thickness a bit better when cooled. (Currently, they look great when I pull them out, but collapse too far when they cool). This will add liquid to the dough, so I'll need to keep an eye on it. Perhaps I'll need a bit more flour to compensate.\n\nAn alternative is to reduce the amount of fat in the cookie or replacing some of the shortening with butter, which will make the cookies a bit drier. These cookies are not supposed to be crispy at all, but I feel that they are still a bit too \"wet\".",
    "id":"20120117_9_011235",
    "link":"",
    "publishedDate":"2012-01-17T01:12:35+00:00",
    "source":"foamtotem",
    "title":"FFC Quest, Continued",
    "via":"",
    "~orig":
        {
        },
    "~orig.728337349_255164224556802":
        {
            "actions":
                [
                    
                    {
                        "link":"http:\/\/www.facebook.com\/728337349\/posts\/255164224556802",
                        "name":"Comment"
                    },
                    
                    {
                        "link":"http:\/\/www.facebook.com\/728337349\/posts\/255164224556802",
                        "name":"Like"
                    }
                ],
            "application":
                {
                },
            "caption":"foamtotem.org",
            "comments":
                {
                    "count":0
                },
            "created_time":"2012-01-17T01:56:36+0000",
            "description":"Since my last post, I have made several modifications to the recipe to try to improve it. Most have met with failure, some catastrophic.",
            "from":
                {
                    "id":"728337349",
                    "name":"Shannon Posniewski"
                },
            "icon":"https:\/\/s-static.ak.facebook.com\/rsrc.php\/v1\/yD\/r\/aS8ecmYRys0.gif",
            "id":"728337349_255164224556802",
            "link":"http:\/\/foamtotem.org\/2012\/20120117_9_011235.html",
            "message":"A brief update on the Fruit Cookies.",
            "name":"FFC Quest, Continued",
            "privacy":
                {
                    "allow":"10150348324912350",
                    "description":"Everyone",
                    "friends":"SOME_FRIENDS",
                    "value":"CUSTOM"
                },
            "type":"link",
            "updated_time":"2012-01-17T01:56:36+0000"
        }
}