{
    "content":"",
    "description":"Went out to Moffett field with ~20,000 other people this morning to see the Shuttle on its trip to LA.",
    "id":"20120921_2_190334",
    "link":"http:\/\/www.facebook.com\/photo.php?v=10151203851911418",
    "message":"Went out to Moffett field with ~20,000 other people this morning to see the Shuttle on its trip to LA. I never thought of myself as a NASA or space shuttle freak like some of my friends (+Iwan Axt and +Dan Wiesen) but it was emotional to see it. It's a weird mix of nostalgia, excitement, longing, and despair.\r\n\r\nI wasn't quite one year old when we first left footprints on the Moon. The Shuttle was a mainstay in any science-oriented kid's life when I was young. Launches and missions were nearly commonplace by the time I was in High School. The Challenger exploded when I was a senior, as if to shake us out of our complacency. It reminded us (or at least me) that these were modern-day explorers and adventurers as much as they were scientists and engineers (and teachers).\r\n\r\nThe span of my life (plus just a bit more) has been the length of Man's time in space. Seeing the shuttle retired isn't necessarily sad, considering the age of its design. Seeing our space program constantly under threat does make me despair a bit. I see it as a harbinger of the death of futurism, of then end of believing in a \"big, bright, beautiful tomorrow\", or that we can't be the ones to bring a better future to fruition. I am weary of defeatism, irony, and nihilism.\r\n\r\nI didn't know until I was out on the runway this morning that my feelings have crystallized in such a way. We need more FUTURE in our lives. We need more Curiosity rovers, more engineers with stars and mohawks on their heads, more exuberance, and more adventure.",
    "name":"Endeavour flyover",
    "picture":"https:\/\/fbcdn-vthumb-a.akamaihd.net\/hvthumb-ak-prn1\/158970_10151203854161418_10151203851911418_55044_2029_t.jpg",
    "picture_cached":"http:\/\/foamtotem.org\/daily\/cache\/20120921_2_190334.jpg",
    "publishedDate":"2012-09-21T19:03:34+00:00",
    "source":"facebook",
    "title":"",
    "type":"link",
    "via":"Facebook",
    "~orig":
        {
            "actions":
                [
                    
                    {
                        "link":"http:\/\/www.facebook.com\/728337349\/posts\/400265543378715",
                        "name":"Comment"
                    },
                    
                    {
                        "link":"http:\/\/www.facebook.com\/728337349\/posts\/400265543378715",
                        "name":"Like"
                    }
                ],
            "application":
                {
                    "id":"2392950137",
                    "name":"Video",
                    "namespace":"video"
                },
            "comments":
                {
                    "count":"0"
                },
            "created_time":"2012-09-21T19:03:34+0000",
            "description":"I first noticed more kids than usual on my ride into work.  And then I noticed that some were wearing NASA flight suits.  So I made a detour and saw this.",
            "from":
                {
                    "id":"728337349",
                    "name":"Shannon Posniewski"
                },
            "icon":"https:\/\/s-static.ak.facebook.com\/rsrc.php\/v2\/yD\/r\/aS8ecmYRys0.gif",
            "id":"728337349_400265543378715",
            "likes":
                {
                    "count":"1",
                    "data":
                        [
                            
                            {
                                "id":"698592870",
                                "name":"Diane Palme"
                            }
                        ]
                },
            "link":"http:\/\/www.facebook.com\/photo.php?v=10151203851911418",
            "message":"Went out to Moffett field with ~20,000 other people this morning to see the Shuttle on its trip to LA. I never thought of myself as a NASA or space shuttle freak like some of my friends (Iwan, Dan) but it was emotional to see it. It's a weird mix of nostalgia, excitement, longing, and despair.\n\nI wasn't quite one year old when we first left footprints on the Moon. The Shuttle was a mainstay in any science-oriented kids life when I was young. Launches and missions were nearly commonplace by the time I was in High School. The Challenger exploded when I was a senior, as if to shake us out of our complacency. It reminded us (or at least me) that these were modern-day explorers and adventurers as much as they were scientists and engineers (and teachers).\n\nThe span of my life (plus just a bit more) has been the length of Man's time in space. Seeing the shuttle retired isn't necessarily sad, considering the age of its design. Seeing our space program constantly under threat does make me sad. I don't want to see the death of futurism, of then end of believing in a \"big, bright, beautiful tomorrow\", or that we can't be the ones to bring a better future to fruition. I'm sick of defeatism, irony, and nihilism.\n\nAnyway, it was surprisingly emotional for me. :)",
            "message_tags":
                {
                    "187":
                        [
                            
                            {
                                "id":"778159473",
                                "length":"4",
                                "name":"Iwan",
                                "offset":"187",
                                "type":"user"
                            }
                        ]
                },
            "name":"Endeavour flyover",
            "object_id":"10151203851911418",
            "picture":"https:\/\/fbcdn-vthumb-a.akamaihd.net\/hvthumb-ak-prn1\/158970_10151203854161418_10151203851911418_55044_2029_t.jpg",
            "privacy":
                {
                    "description":"Public",
                    "value":"EVERYONE"
                },
            "properties":
                [
                    
                    {
                        "name":"Length",
                        "text":"0:34"
                    }
                ],
            "source":"https:\/\/fbcdn-video-a.akamaihd.net\/cfs-ak-snc6\/v\/234991\/835\/10151203851911418_31074.mp4?oh=20f86873edfe6922217c8b9e0a8583d4&oe=505EBD0B&__gda__=1348439056_eef7fe4dc0ea5a24d8742aebe38d3c02",
            "status_type":"shared_story",
            "to":
                {
                    "data":
                        [
                            
                            {
                                "id":"778159473",
                                "name":"Iwan Axt"
                            }
                        ]
                },
            "type":"video",
            "updated_time":"2012-09-21T19:03:34+0000"
        }
}