{
    "comments":
        {
            "data":
                [
                    
                    {
                        "can_remove":"1",
                        "created_time":"2015-07-20T14:45:00+0000",
                        "from":
                            {
                                "id":"10206299706478369",
                                "name":"Matt Miller"
                            },
                        "id":"10153479990022350_10153480014402350",
                        "like_count":0,
                        "message":"I read Seveneves. Very Neal. Skipping huge portions of the narrative to show you obscure, almost side, stories, that all tie into the end. It really felt that the story he wanted to tell was the last third of the book, but he needed the first 2\/3rd to set it up. Saw the ending a mile away, which kinda sucked, but it did hold my interest for the entire 31 hour audiobook, so there's that.",
                        "user_likes":"0"
                    },
                    
                    {
                        "can_remove":"1",
                        "created_time":"2015-07-20T15:58:32+0000",
                        "from":
                            {
                                "id":"781144791905396",
                                "name":"Cheryl Elkins"
                            },
                        "id":"10153479990022350_10153480168382350",
                        "like_count":0,
                        "message":"New book - \"The Martian\" was very entertaining.",
                        "user_likes":"0"
                    },
                    
                    {
                        "can_remove":"1",
                        "created_time":"2015-07-20T16:00:22+0000",
                        "from":
                            {
                                "id":"10204746624931528",
                                "name":"Dave Geoghegan"
                            },
                        "id":"10153479990022350_10153480171302350",
                        "like_count":0,
                        "message":"I read it it was OK , not epic , yes the end is transparent but it's ok , a little long , have you read Marrow , it's not bad haven't seen much buzz about it",
                        "user_likes":"0"
                    },
                    
                    {
                        "can_remove":"1",
                        "created_time":"2015-07-20T16:10:47+0000",
                        "from":
                            {
                                "id":"762521893758391",
                                "name":"Kyle Davis"
                            },
                        "id":"10153479990022350_10153480185862350",
                        "like_count":0,
                        "message":"Seveneves is up next in my audiobook queue.",
                        "user_likes":"0"
                    },
                    
                    {
                        "can_remove":"1",
                        "created_time":"2015-07-20T16:51:54+0000",
                        "from":
                            {
                                "id":"10203509649367805",
                                "name":"Curt Krone"
                            },
                        "id":"10153479990022350_10153480251782350",
                        "like_count":0,
                        "message":"I held off on reading the Expanse books *because* they were being made into a series, but saw enough reviews that I'm currently reading \"Leviathan Wakes\" and liking it.\n\nDefinitely check out Paolo Bacigalupi if you haven't. I just finished \"The Water Knife\" and really enjoyed it. I've liked everything I read by him. His other \"adult\" novel \"The Windup Girl\" was fantastic, and his YA stuff is top-notch: I've liked it all, and it's been loved by all the smart teens I've suggested it to - I think he avoids the YA trap of holding back too much.\n\nI saw so many glowing reviews of Ann Leckie's \"Ancillary Justice\" that I read that a while back. Very interesting exploration of identity, and plenty of weirdness. I found the writing a bit plodding at points, but others didn't seem to feel the same.",
                        "user_likes":"0"
                    },
                    
                    {
                        "can_remove":"1",
                        "created_time":"2015-07-20T17:36:57+0000",
                        "from":
                            {
                                "id":"10100407699388999",
                                "name":"Darga J Dargington III"
                            },
                        "id":"10153479990022350_10153480328067350",
                        "like_count":0,
                        "message":"I'm also hoping seveneves will be more anathem and less reamde.\n\nShannon have you ever read the Mars trilogy by Kim Stanley Robinson? They're slow reads and very dense but also I think very rewarding",
                        "user_likes":"0"
                    },
                    
                    {
                        "can_remove":"1",
                        "created_time":"2015-07-20T18:03:36+0000",
                        "from":
                            {
                                "id":"10202983107952590",
                                "name":"Jeff Weinstein"
                            },
                        "id":"10153479990022350_10153480385297350",
                        "like_count":0,
                        "message":"I read The Water Knife, Seveneves and The Martian while on vacation.  I enjoyed them all.  Another book I can strongly recommend is The Girl with All The Gifts.",
                        "user_likes":"0"
                    },
                    
                    {
                        "can_remove":"1",
                        "created_time":"2015-07-20T20:10:33+0000",
                        "from":
                            {
                                "id":"10202303056075071",
                                "name":"Michael Curley"
                            },
                        "id":"10153479990022350_10153480711677350",
                        "like_count":0,
                        "message":"I was disappointed with seveneves. The first two thirds should have been half of the story or even just a third. I felt the last third was rushed ; the technology was explained away and there truly wasn't any character development.",
                        "user_likes":"0"
                    }
                ]
        },
    "id":"20140721_2_042115",
    "link":"https:\/\/www.facebook.com\/728337349\/posts\/10152567905877350",
    "message":"Book rant incoming...\n\nI thought both \"Wool\" and \"The Martian\" were fine, but neither were amazing works. The plots were fine, but I felt the language in both was bland, simple, and by-the-numbers. Many have been lavishing those books with high praise, and I just don't see it. I've also felt the same sort of twinge regarding Charlie Stross' last couple Laundry novels. And I liked Steelheart, but it was also simple (of course, that's a YA title so maybe I got what I paid for).\n\nI also note that I've been reading these as ebooks rather than paper books and I wonder if that is coloring my perception of the writing itself. I'm not a terribly discerning reader; I don't need my genre fiction to be \"Literature\" (whatever that might be). But I feel like something is missing.\n\nAnother possibility is that many of my favorite authors are writing YA now (instead of \"Adult\") fiction and it affects all their work. In the abstract, I don't mind this as I don't require taboo topics and themes (sex, graphic violence, four-letter words) in my reading. But I wonder if authors are also pulling back on the structure of and language in their books as well. If so, I think that's a mistake; I didn't need my books dumbed down structurally when I was a teen.\n\nRelated: I'm looking for suggestions for some recent-ish scifi to read. Any suggestions?\n\n(I should note that the writing in the Wool series improved markedly by the last book.)",
    "publishedDate":"2014-07-21T04:21:15+00:00",
    "source":"facebook",
    "type":"status",
    "via":"Facebook",
    "~orig":
        {
            "actions":
                [
                    
                    {
                        "link":"https:\/\/www.facebook.com\/728337349\/posts\/10152567905877350",
                        "name":"Comment"
                    },
                    
                    {
                        "link":"https:\/\/www.facebook.com\/728337349\/posts\/10152567905877350",
                        "name":"Like"
                    }
                ],
            "comments":
                {
                    "data":
                        [
                            
                            {
                                "can_remove":"1",
                                "created_time":"2014-07-21T04:30:38+0000",
                                "from":
                                    {
                                        "id":"1411161126",
                                        "name":"Curt Krone"
                                    },
                                "id":"10152567905877350_10152567917707350",
                                "like_count":"0",
                                "message":"I sadly must agree on the last couple Laundry books - I still rather enjoyed them but I feel like maybe Stross is spreading himself too thin. I'm also waiting for Bob to do some more computational demonology. I really wish he'd get back to the business of churning out novels with so many big ideas that they make my head hurt.\n\nPaolo Bacigalupi is an author who IMO does a nice job of juggling both YA and A writing - if anything, I feel like he brings the YA stuff up a notch instead of taking the A down. This has been much appreciated by a clever kid or two who I've turned on to his books. He's been pretty busy on the YA front recently though.",
                                "user_likes":"0"
                            },
                            
                            {
                                "can_remove":"1",
                                "created_time":"2014-07-21T04:54:54+0000",
                                "from":
                                    {
                                        "id":"728337349",
                                        "name":"Shannon Posniewski"
                                    },
                                "id":"10152567905877350_10152567949342350",
                                "like_count":"0",
                                "message":"(There's a recent short by Stross (which I think is free) called Equoid, which was fun.)",
                                "user_likes":"0"
                            },
                            
                            {
                                "can_remove":"1",
                                "created_time":"2014-07-21T04:56:03+0000",
                                "from":
                                    {
                                        "id":"728337349",
                                        "name":"Shannon Posniewski"
                                    },
                                "id":"10152567905877350_10152567950567350",
                                "like_count":"0",
                                "message":"Oh, I forgot to also denounce Ready Player One, which was the actual Genesis of this post.",
                                "user_likes":"0"
                            },
                            
                            {
                                "can_remove":"1",
                                "created_time":"2014-07-21T05:04:58+0000",
                                "from":
                                    {
                                        "id":"547088519",
                                        "name":"Zeke Sparkes"
                                    },
                                "id":"10152567905877350_10152567960827350",
                                "like_count":"0",
                                "message":"Hungry City Chronicles! Sooo good... YA only because there isn't sex. Also because it doesn't feel it has to think too hard about the basic premise. But man oh man the stories and character development are great. :)",
                                "user_likes":"0"
                            },
                            
                            {
                                "can_remove":"1",
                                "created_time":"2014-07-21T05:21:00+0000",
                                "from":
                                    {
                                        "id":"1411161126",
                                        "name":"Curt Krone"
                                    },
                                "id":"10152567905877350_10152567979757350",
                                "like_count":"0",
                                "message":"I just started Equoid last night... \n\nRecently read \"Daemon\" by Daniel Suarez - basically a page-turner for people who are comfortable with TCP\/IP. Not life-changing, but enjoyable, and the tech stuff is very well done.\n\nSimilar feelings about \"Nexus\" by Ramez Naam - he does a pretty respectable job with the tech, and the book's enjoyable enough. I didn't find it anywhere near as ground-breaking as others seem to have, but I did enjoy it.\n\nBut basically I'm still on the hunt for more swing-for-the-fences, overly ambitious space opera, and there's not enough of that happening right now.\n\nI'm hoping that \"On the Steel Breeze\" by Alastair Reynolds picks up the momentum that took so long to get established in \"Blue Remembered Earth\". When he's on, he can be really good. You might also want to check out Peter Watts if you haven't already. Clearly a deeply intelligent dude, and I've like the stuff I've read by him.",
                                "user_likes":"0"
                            },
                            
                            {
                                "can_remove":"1",
                                "created_time":"2014-07-21T06:43:31+0000",
                                "from":
                                    {
                                        "id":"1032884197",
                                        "name":"Douglas Smith"
                                    },
                                "id":"10152567905877350_10152568067887350",
                                "like_count":"0",
                                "message":"I liked Zoo City, I read that last year. More strange fiction than science fiction...",
                                "user_likes":"0"
                            },
                            
                            {
                                "can_remove":"1",
                                "created_time":"2014-07-21T06:50:31+0000",
                                "from":
                                    {
                                        "id":"1411161126",
                                        "name":"Curt Krone"
                                    },
                                "id":"10152567905877350_10152568074557350",
                                "like_count":"0",
                                "message":"Zoo City was good - Lauren Beukes has a new book out if i recall correctly. Haven't had a chance to get to it yet.",
                                "user_likes":"0"
                            },
                            
                            {
                                "can_remove":"1",
                                "created_time":"2014-07-21T09:42:27+0000",
                                "from":
                                    {
                                        "id":"770382751",
                                        "name":"Jenn Jumper"
                                    },
                                "id":"10152567905877350_10152568250492350",
                                "like_count":"0",
                                "message":"I was not blown away by The Martian or Ready Player One, either.  I really, really loved John Birmingham's \"Without Warning\" trilogy.  Alternate history stuff.",
                                "user_likes":"0"
                            },
                            
                            {
                                "can_remove":"1",
                                "created_time":"2014-07-21T10:38:42+0000",
                                "from":
                                    {
                                        "id":"1245484058",
                                        "name":"Sarah Rain"
                                    },
                                "id":"10152567905877350_10152568315637350",
                                "like_count":"0",
                                "message":"The entire purpose of Ready Player One seemed to be nostalgic,  not to tell a good story. YA is definitely dumbed down, both in the writing and the plots; in particular most authors tend to hand-feed clues to make mysteries\/ twists obvious. I think this is getting worse over time and not just because I'm an older, more sophisticated reader... the writing of The White Mountains still holds up, for example.",
                                "user_likes":"0"
                            },
                            
                            {
                                "can_remove":"1",
                                "created_time":"2014-07-21T10:52:41+0000",
                                "from":
                                    {
                                        "id":"502940974",
                                        "name":"Michele Axt"
                                    },
                                "id":"10152567905877350_10152568329207350",
                                "like_count":"0",
                                "message":"I'm going to find my old Christopher pike books from way back when-that was some wacky stuff",
                                "user_likes":"0"
                            },
                            
                            {
                                "can_remove":"1",
                                "created_time":"2014-07-21T18:33:03+0000",
                                "from":
                                    {
                                        "id":"558871356",
                                        "name":"Jim Whitehead"
                                    },
                                "id":"10152567905877350_10152569112017350",
                                "like_count":"0",
                                "message":"I can recommend the Culture novels by Iain M. Banks, excellent writing, solid plot development, well motivated characters. I also recently read Shadow Man by Melissa Scott (from the mid-90s), and found it thought provoking (though not well plotted).",
                                "user_likes":"0"
                            },
                            
                            {
                                "can_remove":"1",
                                "created_time":"2014-07-21T18:34:37+0000",
                                "from":
                                    {
                                        "id":"558871356",
                                        "name":"Jim Whitehead"
                                    },
                                "id":"10152567905877350_10152569114127350",
                                "like_count":"0",
                                "message":"Perdido Street Station by China Mieville is another oldie but goodie.",
                                "user_likes":"0"
                            },
                            
                            {
                                "can_remove":"1",
                                "created_time":"2014-07-21T19:26:05+0000",
                                "from":
                                    {
                                        "id":"728337349",
                                        "name":"Shannon Posniewski"
                                    },
                                "id":"10152567905877350_10152569220352350",
                                "like_count":"0",
                                "message":"I have devoured the Culture novels. They are great. (Banks' sudden death is sad.)",
                                "user_likes":"0"
                            },
                            
                            {
                                "can_remove":"1",
                                "created_time":"2014-07-22T03:38:51+0000",
                                "from":
                                    {
                                        "id":"1411161126",
                                        "name":"Curt Krone"
                                    },
                                "id":"10152567905877350_10152570071822350",
                                "like_count":"0",
                                "message":"I'm still working my way through the Virga books, which I've really enjoyed.",
                                "user_likes":"0"
                            },
                            
                            {
                                "can_remove":"1",
                                "created_time":"2014-07-22T04:15:40+0000",
                                "from":
                                    {
                                        "id":"1805796131",
                                        "name":"Katherine Murray"
                                    },
                                "id":"10152567905877350_10152570113732350",
                                "like_count":"0",
                                "message":"CJ Sansomes Matthew SHardlake series.  HIGHLY recommend!",
                                "user_likes":"0"
                            },
                            
                            {
                                "can_remove":"1",
                                "created_time":"2014-07-22T04:43:50+0000",
                                "from":
                                    {
                                        "id":"728337349",
                                        "name":"Shannon Posniewski"
                                    },
                                "id":"10152567905877350_10152570141077350",
                                "like_count":"0",
                                "message":"Read \"Sun of Suns\" and \"Queen...\" and thought they were pretty good. But I didn't buy the next one so maybe I didn't like them enough... Or maybe there was no sequel at that time...",
                                "user_likes":"0"
                            },
                            
                            {
                                "can_remove":"1",
                                "created_time":"2014-07-22T04:55:47+0000",
                                "from":
                                    {
                                        "id":"1411161126",
                                        "name":"Curt Krone"
                                    },
                                "id":"10152567905877350_10152570152112350",
                                "like_count":"0",
                                "message":"I just finished \"The Sunless Countries\", and will soon go to the next one - more and more of the universe unfolds in each book, and things are definitely not as they seemed at the start.",
                                "user_likes":"0"
                            }
                        ],
                    "paging":
                        {
                            "cursors":
                                {
                                    "after":"MTc=",
                                    "before":"MQ=="
                                }
                        }
                },
            "created_time":"2014-07-21T04:21:15+0000",
            "from":
                {
                    "id":"728337349",
                    "name":"Shannon Posniewski"
                },
            "id":"728337349_10152567905877350",
            "likes":
                {
                    "data":
                        [
                            
                            {
                                "id":"1708109",
                                "name":"Jeff Hamilton"
                            }
                        ],
                    "paging":
                        {
                            "cursors":
                                {
                                    "after":"MTcwODEwOQ==",
                                    "before":"MTcwODEwOQ=="
                                }
                        }
                },
            "message":"Book rant incoming...\n\nI thought both \"Wool\" and \"The Martian\" were fine, but neither were amazing works. The plots were fine, but I felt the language in both was bland, simple, and by-the-numbers. Many have been lavishing those books with high praise, and I just don't see it. I've also felt the same sort of twinge regarding Charlie Stross' last couple Laundry novels. And I liked Steelheart, but it was also simple (of course, that's a YA title so maybe I got what I paid for).\n\nI also note that I've been reading these as ebooks rather than paper books and I wonder if that is coloring my perception of the writing itself. I'm not a terribly discerning reader; I don't need my genre fiction to be \"Literature\" (whatever that might be). But I feel like something is missing.\n\nAnother possibility is that many of my favorite authors are writing YA now (instead of \"Adult\") fiction and it affects all their work. In the abstract, I don't mind this as I don't require taboo topics and themes (sex, graphic violence, four-letter words) in my reading. But I wonder if authors are also pulling back on the structure of and language in their books as well. If so, I think that's a mistake; I didn't need my books dumbed down structurally when I was a teen.\n\nRelated: I'm looking for suggestions for some recent-ish scifi to read. Any suggestions?\n\n(I should note that the writing in the Wool series improved markedly by the last book.)",
            "privacy":
                {
                    "allow":"",
                    "deny":"",
                    "description":"Public",
                    "friends":"",
                    "networks":"",
                    "value":"EVERYONE"
                },
            "status_type":"mobile_status_update",
            "type":"status",
            "updated_time":"2014-07-22T04:55:47+0000"
        },
    "~orig.728337349_10153479990022350":
        {
            "actions":
                [
                    
                    {
                        "link":"https:\/\/www.facebook.com\/728337349\/posts\/10153479990022350",
                        "name":"Comment"
                    },
                    
                    {
                        "link":"https:\/\/www.facebook.com\/728337349\/posts\/10153479990022350",
                        "name":"Like"
                    }
                ],
            "application":
                {
                },
            "comments":
                {
                    "data":
                        [
                            
                            {
                                "can_remove":"1",
                                "created_time":"2015-07-20T14:45:00+0000",
                                "from":
                                    {
                                        "id":"10206299706478369",
                                        "name":"Matt Miller"
                                    },
                                "id":"10153479990022350_10153480014402350",
                                "like_count":0,
                                "message":"I read Seveneves. Very Neal. Skipping huge portions of the narrative to show you obscure, almost side, stories, that all tie into the end. It really felt that the story he wanted to tell was the last third of the book, but he needed the first 2\/3rd to set it up. Saw the ending a mile away, which kinda sucked, but it did hold my interest for the entire 31 hour audiobook, so there's that.",
                                "user_likes":"0"
                            },
                            
                            {
                                "can_remove":"1",
                                "created_time":"2015-07-20T15:58:32+0000",
                                "from":
                                    {
                                        "id":"781144791905396",
                                        "name":"Cheryl Elkins"
                                    },
                                "id":"10153479990022350_10153480168382350",
                                "like_count":0,
                                "message":"New book - \"The Martian\" was very entertaining.",
                                "user_likes":"0"
                            },
                            
                            {
                                "can_remove":"1",
                                "created_time":"2015-07-20T16:00:22+0000",
                                "from":
                                    {
                                        "id":"10204746624931528",
                                        "name":"Dave Geoghegan"
                                    },
                                "id":"10153479990022350_10153480171302350",
                                "like_count":0,
                                "message":"I read it it was OK , not epic , yes the end is transparent but it's ok , a little long , have you read Marrow , it's not bad haven't seen much buzz about it",
                                "user_likes":"0"
                            },
                            
                            {
                                "can_remove":"1",
                                "created_time":"2015-07-20T16:10:47+0000",
                                "from":
                                    {
                                        "id":"762521893758391",
                                        "name":"Kyle Davis"
                                    },
                                "id":"10153479990022350_10153480185862350",
                                "like_count":0,
                                "message":"Seveneves is up next in my audiobook queue.",
                                "user_likes":"0"
                            },
                            
                            {
                                "can_remove":"1",
                                "created_time":"2015-07-20T16:51:54+0000",
                                "from":
                                    {
                                        "id":"10203509649367805",
                                        "name":"Curt Krone"
                                    },
                                "id":"10153479990022350_10153480251782350",
                                "like_count":0,
                                "message":"I held off on reading the Expanse books *because* they were being made into a series, but saw enough reviews that I'm currently reading \"Leviathan Wakes\" and liking it.\n\nDefinitely check out Paolo Bacigalupi if you haven't. I just finished \"The Water Knife\" and really enjoyed it. I've liked everything I read by him. His other \"adult\" novel \"The Windup Girl\" was fantastic, and his YA stuff is top-notch: I've liked it all, and it's been loved by all the smart teens I've suggested it to - I think he avoids the YA trap of holding back too much.\n\nI saw so many glowing reviews of Ann Leckie's \"Ancillary Justice\" that I read that a while back. Very interesting exploration of identity, and plenty of weirdness. I found the writing a bit plodding at points, but others didn't seem to feel the same.",
                                "user_likes":"0"
                            },
                            
                            {
                                "can_remove":"1",
                                "created_time":"2015-07-20T17:36:57+0000",
                                "from":
                                    {
                                        "id":"10100407699388999",
                                        "name":"Darga J Dargington III"
                                    },
                                "id":"10153479990022350_10153480328067350",
                                "like_count":0,
                                "message":"I'm also hoping seveneves will be more anathem and less reamde.\n\nShannon have you ever read the Mars trilogy by Kim Stanley Robinson? They're slow reads and very dense but also I think very rewarding",
                                "user_likes":"0"
                            },
                            
                            {
                                "can_remove":"1",
                                "created_time":"2015-07-20T18:03:36+0000",
                                "from":
                                    {
                                        "id":"10202983107952590",
                                        "name":"Jeff Weinstein"
                                    },
                                "id":"10153479990022350_10153480385297350",
                                "like_count":0,
                                "message":"I read The Water Knife, Seveneves and The Martian while on vacation.  I enjoyed them all.  Another book I can strongly recommend is The Girl with All The Gifts.",
                                "user_likes":"0"
                            },
                            
                            {
                                "can_remove":"1",
                                "created_time":"2015-07-20T20:10:33+0000",
                                "from":
                                    {
                                        "id":"10202303056075071",
                                        "name":"Michael Curley"
                                    },
                                "id":"10153479990022350_10153480711677350",
                                "like_count":0,
                                "message":"I was disappointed with seveneves. The first two thirds should have been half of the story or even just a third. I felt the last third was rushed ; the technology was explained away and there truly wasn't any character development.",
                                "user_likes":"0"
                            }
                        ],
                    "paging":
                        {
                            "cursors":
                                {
                                    "after":"WTI5dGJXVnVkRjlqZFhKemIzSTZNVEF4TlRNME9EQTNNVEUyTnpjek5UQTZNVFF6TnpReU16QXpNdz09",
                                    "before":"WTI5dGJXVnVkRjlqZFhKemIzSTZNVEF4TlRNME9EQXdNVFEwTURJek5UQTZNVFF6TnpRd016VXdNQT09"
                                }
                        }
                },
            "created_time":"2015-07-20T14:37:50+0000",
            "description":"Book rant incoming...\n\nI thought both \"Wool\" and \"The Martian\" were fine, but neither were amazing works. The plots were fine, but I felt the language in both was bland, simple, and by-the-numbers. Many have been lavishing those books with high praise, and I just don't see it. I've also felt the same sort of twinge regarding Charlie Stross' last couple Laundry novels. And I liked Steelheart, but it was also simple (of course, that's a YA title so maybe I got what I paid for).\n\nI also note that I've been reading these as ebooks rather than paper books and I wonder if that is coloring my perception of the writing itself. I'm not a terribly discerning reader; I don't need my genre fiction to be \"Literature\" (whatever that might be). But I feel like something is missing.\n\nAnother possibility is that many of my favorite authors are writing YA now (instead of \"Adult\") fiction and it affects all their work. In the abstract, I don't mind this as I don't require taboo topics and themes (sex, graphic violence, four-letter words) in my reading. But I wonder if authors are also pulling back on the structure of and language in their books as well. If so, I think that's a mistake; I didn't need my books dumbed down structurally when I was a teen.\n\nRelated: I'm looking for suggestions for some recent-ish scifi to read. Any suggestions?\n\n(I should note that the writing in the Wool series improved markedly by the last book.)",
            "from":
                {
                    "id":"728337349",
                    "name":"Shannon Posniewski"
                },
            "id":"728337349_10153479990022350",
            "is_expired":"0",
            "is_hidden":"0",
            "link":"https:\/\/www.facebook.com\/728337349\/posts\/10152567905877350",
            "message":"Reposting this from last year because the comments have books I still haven't gotten to. Has anyone read and liked Seveneves? I really enjoyed Anathem, but not Reamde or the System of ten World series. Not mentioned last time are Joe Abercrombie's fantasy novels, all of which are really good. I did read the Nexus series (which is now concluded) and liked it. Corey's Expanse series is good, even if SyFy is turning it into a TV show. I like Rothfuss' Name of the Wind (fantasy) series so far, but the next book(s) have been long coming and there's no hint as to when or if they'll ever come. Sanderson somehow keeps writing a ton of stuff. Firefight is the YA sequel to Steelheart, was good but still simplistic due to YA. His Legion stories are actually kinda neat too.",
            "name":"Shannon",
            "picture":"https:\/\/fbcdn-profile-a.akamaihd.net\/hprofile-ak-xtf1\/v\/t1.0-1\/p100x100\/11760205_10153495692982350_3322671448736832283_n.jpg?oh=320c48cf3f26fb0d63aaa9b1a1cd6f24&oe=5612334C&__gda__=1447588058_2dabff4eab11e68102f0e2ff4d65390e",
            "privacy":
                {
                    "allow":"",
                    "deny":"",
                    "description":"Public",
                    "friends":"",
                    "value":"EVERYONE"
                },
            "status_type":"mobile_status_update",
            "story":"Shannon Posniewski shared a memory from July 20, 2014.",
            "subscribed":"1",
            "type":"link",
            "updated_time":"2015-07-20T21:58:21+0000"
        }
}