{
    "content":"",
    "description":"Wynton Marsalis:\r\n<blockquote>Yesterday we drove 4 hours from Fayetteville, Arkansas to Pine Bluff to visit the great Clark Terry (CT as we call him). This was a day off and originally planned as a trip to his home to celebrate his upcoming 94th birthday (on December 14th) but an emergency on Friday night had landed CT in the hospital. [...]<\/blockquote>",
    "id":"20141210_2_174020",
    "link":"https:\/\/www.facebook.com\/wyntonmarsalis\/posts\/10152832454392976",
    "name":"",
    "picture":"https:\/\/fbcdn-sphotos-h-a.akamaihd.net\/hphotos-ak-xap1\/v\/t1.0-9\/q83\/p100x100\/10565225_10152832453512976_4466315629406590868_n.jpg?oh=660a903731a217001ae2788c71795917&oe=550F3755&__gda__=1427556510_8c947ab5940cf26a5c07d183ee64326b",
    "picture_cached":"http:\/\/foamtotem.org\/daily\/cache\/20141210_2_174020.jpg",
    "publishedDate":"2014-12-10T17:40:20+00:00",
    "source":"facebook",
    "title":"",
    "type":"link",
    "via":"Facebook for Android",
    "~orig":
        {
            "actions":
                [
                    
                    {
                        "link":"https:\/\/www.facebook.com\/728337349\/posts\/10152903686712350",
                        "name":"Comment"
                    },
                    
                    {
                        "link":"https:\/\/www.facebook.com\/728337349\/posts\/10152903686712350",
                        "name":"Like"
                    }
                ],
            "application":
                {
                    "id":"350685531728",
                    "name":"Facebook for Android",
                    "namespace":"fbandroid"
                },
            "created_time":"2014-12-10T17:40:20+0000",
            "description":"Yesterday we drove 4 hours from Fayetteville, Arkansas to Pine Bluff to visit the great Clark Terry (CT as we call him). This was a day off and originally planned as a trip to his home to celebrate his upcoming 94th birthday (on December 14th) but an emergency on Friday night had landed CT in the hospital. With literally no lead-time, the hospital was able to source and set up a classroom so we could come in and play for him. As we pulled up to the everyday world of the hospital, with two tour buses and an equipment truck, we knew it would be special. From the security guards who set aside parking spaces for us, to the hospital administrators, aides and the assistants working specifically with Clark, to his wife Gwen and some of their friends, everyone and everything was soaked in hospitality, human feeling and soul. \n \nWe filed in and quickly set the band up. CT has been such a positive influence on so many of us in the orchestra; we were of one mind about the way we wanted to play for him.  Swing! Even before we started playing, many of us were full of emotion.\n\nI reflected on the depth of Clark's impact on me and was overcome. At 14-15, he was the first great jazz trumpeter I had ever heard actually playing live. His spectacular playing made me want to practice (of course) but his warmth and optimism made me to want to be a part of the world of Jazz. I would try to stand like him, play like him, announce tunes like him and treat people the way he did. And each of us in the band had personal stories like that about Clark. For our trumpet section, he is a Great Immortal. Back when Ryan Kisor was a high school kid in Iowa, CT was the first one to tell me, \"There's a young boy in Iowa who can truly play.\" \"Iowa?\" \"Yeah man, for real!\" \n \nMoving a big band around on a scheduled day off can be very complicated. And any last minute adjustments will definitely create logistical havoc. But a number of our team displayed dedication and determination to make things go smoothly. Victor demonstrated his advanced communication skills in coordinating all of the particulars with Gwen. Big Boss Murphy kept us on point by responding to each challenge with a calm even-handedness. Gabrielle Armand and our JALC staff in New York provided whatever was needed to assist with the hospitality. Chris Crenshaw transcribed a couple of Jimmy Heath arrangements that featured Clark on lead trumpet: “West Coast Blues”, a Wes Montgomery composition from Blue Mitchell's album entitled “A Sure Thing” and “Nails”, from a Jimmy Heath Orchestra recording entitled “Really Big!”\n \nAs Clark's bed was wheeled in we launched into Duke and Strayhorn's “Peanut Brittle Brigade” from their version of Tchaikovsky's “Nutcracker”. After playing, we each went over to his bed, introduced ourselves and said a little something about our pedigree and how much we appreciated his contributions to our personal development and to the music. He recognized each of us and responded to every salutation with some pithy comment of joyful appreciation. \n \nThe hospital staff stood by watching in amazement as this informal caravan of musicians who had transformed this classroom into a concert hall, genuflected one by one before a patient who they knew was important for some reason.... but this type of homage perhaps meant something different from whatever their perceptions might have been. Without knowing his music or his profoundly personal influence on so many of us it was probably impossible for them to realize that they were caring for one of the world's great Maestros.  \n \nWhen it was his turn, Carlos enthusiastically told Clark, \"I'm representing all of the Puerto Ricans in the Bronx. They send their love.\" And we all cracked up. \n\nWe then played Basie's “Good Morning Blues” and let him check out Cécile. She stood right next to his bed and sang into a microphone connected to his headphones. She too was overcome with emotion, but she sang with poise and so poetically. It was elegant, yet intimate, like someone singing to a beloved family member. As soon as he recognized that unique quality in her voice, he started cosigning her and demonstrating that infectious personality that always made you feel great about playing. \n \nChris introduced the “West Coast Blues” and told Clark when it was recorded. He didn't remember so Chris started to sing it. After a few bars of Clark trying to remember Chris said, \"You'll know it when you hear it.\" We played and cats were swinging hard for him. As we were playing, he asked Gwen to identify each soloist. Our sound stylist, David Robinson, helped her call everyone out. \n \nWe didn’t want to stop, but it was time for all of us to go. But before that somber moment, we gathered around the bed and played “Happy Birthday” for him. When he went to blow out the candles, he broke down.  Many of us joined him.  \n \nWe all said goodbye and he once again recognized each individual with a touch and some kind words. We took a good picture with the trumpet section of which Vincent said, \"This is the only time I'll make way for y'all.\" And then it was that time.\n\nWhat is deeper than respect and love? That's what we felt: veneration. \n \nLater we went to Clark's home. Gwen and some friends had a spread laid out. Good fried chicken and catfish, coleslaw, succotash…you know, the usual suspects that never wear out their welcome.  Pure southern soul. \n \nAfter eating, Ted and I sat in Clark's den surrounded by memorabilia from his career plus a not-completely-assembled drum set and a couple of African drums. The mantelpiece was dominated by a large picture of CT and Sweets Edison playing together. Right after Sweets passed away, I remember Clark telling me that he had left him his suits. \"How am I going to wear those big-ass suits?\" was what he said. And we laughed thinking about how Sweets would have laughed at that.\n \nTed and I reminisced about seeing Clark play on the Tonight Show with Johnny Carson during the 70's. He had all kinds of tricks like playing the trumpet with both hands or upside down, or playing trumpet and flugelhorn at once. These antics amazed and delighted audiences, but he was playing great ideas the whole time. I recalled him coming to see me play with the New Orleans Philharmonic when I was 16 and telling me how much he loved it at the club later that night. Ted recounted playing with the California all state high school jazz band in 1975 when he was 15. They performed at the Monterey Jazz Festival and Clark was guest soloist. On one song, a blues, Ted came out front to play the soprano saxophone with him. When the song finished, CT grabbed the mic and said enthusiastically \"Ted Nash on soprano!\" The feeling in that introduction by the great Clark Terry of an unknown high school musician gave an almost spiritual validation to Ted's playing.\n\nWe recognized that he also did that for many thousands of other musicians throughout his career. He lived as a jazzman, full of soul and sophistication, sass, grit and mother wit, and he made us want to become real jazz musicians. \n \nWe talked about how good it felt that many of us were moved to tears in his presence. And we weren't emotional because he was blind and bedridden, or because he was having trouble hearing, had lost some of his limbs and was in a hospital. He's 94! We were full of emotion because his presence reminded us of how much of himself he had given to the world, this country, our music, our instrument and each of us individually. And it hit us. All the gigs, recordings, lessons, bands, students, all state jazz orchestras, master classes, TV shows, world beating concerts with Basie and Ellington, his own groups, jam sessions - and all of it at the absolute highest level of engagement- was laying in the bed before us. And we wanted him to be proud and feel the love we felt for him. It was palpable. After we left I said, \"Man, CT always had a way of lifting you up.\" Ted countered and said, \"HAD a way? He still IS that way. It was there today.\" \n\nYeah. He blessed us.\n\nWynton",
            "from":
                {
                    "id":"728337349",
                    "name":"Shannon Posniewski"
                },
            "icon":"https:\/\/fbstatic-a.akamaihd.net\/rsrc.php\/v2\/yD\/r\/aS8ecmYRys0.gif",
            "id":"728337349_10152903686712350",
            "likes":
                {
                    "data":
                        [
                            
                            {
                                "id":"100000962093789",
                                "name":"Marilyn Harris Collins"
                            },
                            
                            {
                                "id":"1361476318",
                                "name":"Michele Liguori"
                            }
                        ],
                    "paging":
                        {
                            "cursors":
                                {
                                    "after":"MTM2MTQ3NjMxOA==",
                                    "before":"MTAwMDAwOTYyMDkzNzg5"
                                }
                        }
                },
            "link":"https:\/\/www.facebook.com\/wyntonmarsalis\/posts\/10152832454392976",
            "name":"Wynton Marsalis",
            "picture":"https:\/\/fbcdn-sphotos-h-a.akamaihd.net\/hphotos-ak-xap1\/v\/t1.0-9\/q83\/p100x100\/10565225_10152832453512976_4466315629406590868_n.jpg?oh=660a903731a217001ae2788c71795917&oe=550F3755&__gda__=1430148510_58bb75fce56dc2dd23c44b6975b33c33",
            "privacy":
                {
                    "allow":"",
                    "deny":"",
                    "description":"Public",
                    "friends":"",
                    "networks":"",
                    "value":"EVERYONE"
                },
            "status_type":"shared_story",
            "story":"Shannon Posniewski shared Wynton Marsalis's status update.",
            "type":"link",
            "updated_time":"2014-12-10T17:40:20+0000"
        }
}